content/teaching/schemes/index.org
#+title: Foundations of algebraic geometry, aka schemes 2020
#+HTML_HEAD_EXTRA: <script src="/js/collapsibility.js"></script>

* Introduction
:PROPERTIES:
:html_headline_class: collapsible
:END:

We will learn the modern foundations of algebraic geometry: sheaves, schemes, and cohomology from [[http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf][Ravi Vakil's book-in-progress]], online lecture videos, and weekly discussions.

We will hang out at [[https://schemes2020.zulipchat.com][**schemes2020 on zulip**]].


* Prerequisites
:PROPERTIES:
:html_headline_class: collapsible
:END:

A solid foundation in topology and algebra (rings, fields, modules), and familiarity with some algebraic geometry or commutative algebra and the language of categories.
This means HD in Analysis 1, Algebra 1, Algebra 2, and either Algebra 3 or a Special Topics Course about algebraic geometry (Martin/Markus) or commutative algebra (Amnon).
**If you are taking this course for a grade, you must have these pre-requisites or my explicit permission.** But in the open spirit of Ravi's project, if you want to participate (audit) this course, you are welcome! 


* Assessement
:PROPERTIES:
:html_headline_class: collapsible
:END:

1.  5 written assignments (50%)
2.  Two oral exams (50%)


** Written assignments 
:PROPERTIES:
:html_headline_class: collapsible
:END:

1.  Due 14 Aug: 1.3.E, 1.4.E, 2.3.A, 2.3.I, 2.3.J, 2.4.E, 2.4.N, 2.4.O.
2.  Due 04 Sep: 3.2.K, 3.2.M, 3.2.R, 3.2.S, 3.4.I, 3.6.C, 3.6.N, 4.3.F.
3.  Due 02 Oct: 4.3.C, 4.5.I, 5.1.E, 5.1.I, 5.2.F, 6.3.H, 6.3.M, 8.1.J (b,d).
4.  Due 16 Oct: 8.2.N, 8.2.P, 9.2.D, 9.2.H, 9.4.B (c,d,f,g), 13.3.F, 13.3.G, 13.4.A
5.  Due 5 Nov:
   -   13.7.D + find the support of the module associated to \(k[x,y]/xy\) on \({\rm Spec}\ k[x,y]\).
   -   13.7.F
   -   13.7.K
   -   14.1.D
   -   14.2.K
   -   Which line bundles on \(\mathbb P^n_k\) are globally generated?
   -   Let \(f \colon \mathbb P^1_k \to \mathbb P^n_k\) be a map such that \(f^*O(1) = O(d)\). Suppose \(d < n\). Prove that the image of \(f\) must lie on a hyperplane.
   -   Prove that the automorphism group of \(P^n_k\) is the group \(PGL_{n+1}(k)\).


** Midterm exam
:PROPERTIES:
:html_headline_class: collapsible
:END:

The midterm exam will be an oral exam in the week of September 21. It will be about 45 minutes long. I have prepared [[midterm1.pdf][a list of questions for the exam]]. We will ask questions from this list, small variations on them, and follow up questions based on your responses.


** Final exam
:PROPERTIES:
:html_headline_class: collapsible
:END:
**** Practice questions

1.  Let \(X\) be a Noetherian scheme.
   -   Give the definition of a quasi-coherent sheaf on \(X\).
   -   Give an example of a quasi-coherent sheaf that is not coherent.
   -   Give an example of a coherent sheaf that is not locally free.
   -   Is a subsheaf of a locally free sheaf necessarily locally free?
   -   Suppose \(F\) is a coherent sheaf such that the stalks \(F_x\) are free for all (closed) points \(x\). Must \(F\) be free? Locally free?

2.  Let \(X = {\rm Spec}\ A\).
   -   Explain the relationship between closed subschemes of \(X\) and ideals of \(A\).
   -   Let \(Y \to X\) and \(Z \to X\) be closed embeddings. Is \(Y \times_X Z \to X\) also a closed embedding? What if \(X\) is not affine? What about open embeddings?

3.  Let \(X = {\rm Proj}\ \mathbb Q[X,Y,Z]/(X^2+Y^2+Z^2)\).
   -   Is there a map \({\rm Spec}\ \mathbb Q \to X\)?
   -   Prove that \(X \times {\rm Spec}\ \mathbb C\) is isomorphic to \(\mathbb P^1_{\mathbb C}\).
   -   Is \(X\) isomorphic to \(\mathbb P^1_{\mathbb Q}\)?
   -   Describe a closed embedding of \(X \times X\) in \(\mathbb P^n_{\mathbb Z}\) for some \(n\).

4.  Let \(X = \mathbb P^1_\mathbb C\). Let \(p = [0:1]\) and \(q = [1:0]\).
   -   Describe the sheaf \(O(p-q)\).
   -   Is this quasi-coherent? Coherent? Locally free?
   -   What more can you say about it?
   -   What if I had taken a different linear combination of a different set of points?

5.  Everything in this question is over a field \(k\).
   -   What is the Picard group of \(\mathbb P^n\)?
   -   What about \(\mathbb P^n \times \mathbb P^m\)?
   -   Let \(L = \pi_1^* O(a) \otimes \pi_2^* O(b)\) on \(\mathbb P^1 \times \mathbb P^1\). For which \(a\) and \(b\) does \(L\) have a global section? is globally generated?
   -   Describe some global sections of \(L\) when \(a = 1\) and \(b = 1\).
   -   Do the sections you wrote define a map to a projective space?
   -   What is the nature of this map? (Finite, open embedding, closed embedding, constant)?

6.  Let \(X = \mathbb P^2_k\).
   -   What is the Euler characteristic of the structure sheaf of \(m\) points?
   -   What is the Euler characteristic of the ideal sheaf of \(m\) points?
   -   Let \(I\) be the ideal sheaf of \(6\) points. Using the short exact sequence on cohomology, can you make a guess about the dimension of \(H^i(I)\)? What about \(H^i(I(n))\)? Should these numbers be the same for all configurations of the points?


***** Marking

Five major areas. Each out of 10.

1.  Quasi-coherent and coherent sheaves, stalks, fibers, support.
2.  Local freeness, kernels/cokernels, pull-backs, push-forwards.
3.  Open and closed embeddings, fiber products.
4.  Line bundles, divisors, maps to projective space.
5.  Global sections, cohomology, Euler characteristic.


* Weekly reading, viewing, and doing
:PROPERTIES:
:html_headline_class: collapsible
:END:

"Do" does not mean "write up and submit". 
A general convention in Ravi's book is that ⋆ indicates an advanced section that can be skipped on the first reading.

** Week 12
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   **Read/skim**: 18.1, 18.2, 18.3, 18.4
-   **Do**: 
  -   Exercise 18.3.A
  -   Exercise 18.4.A
  -   Exercise 18.4.B/C (maybe)
-   **Watch**
  1.  [[<https://vimeo.com/470803503>][Sheaf cohomology]]
  2.  [[<https://vimeo.com/470835362>][Cohomology of quasicoherent sheaves]]
  3.  [[<https://vimeo.com/472058119>][Cech cohomology and the Picard group]]


