docs/teaching/schemes/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-24 Fri 23:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Foundations of algebraic geometry, aka schemes 2020</title>
<meta name="author" content="Anand Deopurkar" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/main.css"></link><link href="https://fonts.googleapis.com/css?family=Lora:400,400i,700,700i" rel="stylesheet"></link></head>
<body>
<div id="content" class="content">
<h1 class="title">Foundations of algebraic geometry, aka schemes 2020</h1>

<div id="outline-container-orgf16a697" class="outline-2">
<h2 id="orgf16a697" class="collapsible">Introduction</h2>
<div class="outline-text-2" id="text-orgf16a697">
<p>
We will learn the modern foundations of algebraic geometry: sheaves, schemes, and cohomology from <a href="http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf">Ravi Vakil&rsquo;s book-in-progress</a>, online lecture videos, and weekly discussions.
</p>

<p>
We will hang out at <a href="https://schemes2020.zulipchat.com"><b><b>schemes2020 on zulip</b></b></a>.
</p>
</div>
</div>


<div id="outline-container-org27c1ec2" class="outline-2">
<h2 id="org27c1ec2" class="collapsible">Prerequisites</h2>
<div class="outline-text-2" id="text-org27c1ec2">
<p>
A solid foundation in topology and algebra (rings, fields, modules), and familiarity with some algebraic geometry or commutative algebra and the language of categories.
This means HD in Analysis 1, Algebra 1, Algebra 2, and either Algebra 3 or a Special Topics Course about algebraic geometry (Martin/Markus) or commutative algebra (Amnon).
<b><b>If you are taking this course for a grade, you must have these pre-requisites or my explicit permission.</b></b> But in the open spirit of Ravi&rsquo;s project, if you want to participate (audit) this course, you are welcome! 
</p>
</div>
</div>


<div id="outline-container-org6313186" class="outline-2">
<h2 id="org6313186" class="collapsible">Assessement</h2>
<div class="outline-text-2" id="text-org6313186">
<ol class="org-ol">
<li>5 written assignments (50%)</li>
<li>Two oral exams (50%)</li>
</ol>
</div>


<div id="outline-container-orgf73f57f" class="outline-3">
<h3 id="orgf73f57f" class="collapsible">Written assignments</h3>
<div class="outline-text-3" id="text-orgf73f57f">
<ol class="org-ol">
<li>Due 14 Aug: 1.3.E, 1.4.E, 2.3.A, 2.3.I, 2.3.J, 2.4.E, 2.4.N, 2.4.O.</li>
<li>Due 04 Sep: 3.2.K, 3.2.M, 3.2.R, 3.2.S, 3.4.I, 3.6.C, 3.6.N, 4.3.F.</li>
<li>Due 02 Oct: 4.3.C, 4.5.I, 5.1.E, 5.1.I, 5.2.F, 6.3.H, 6.3.M, 8.1.J (b,d).</li>
<li>Due 16 Oct: 8.2.N, 8.2.P, 9.2.D, 9.2.H, 9.4.B (c,d,f,g), 13.3.F, 13.3.G, 13.4.A</li>
<li>Due 5 Nov:
<ul class="org-ul">
<li>13.7.D + find the support of the module associated to \(k[x,y]/xy\) on \({\rm Spec}\ k[x,y]\).</li>
<li>13.7.F</li>
<li>13.7.K</li>
<li>14.1.D</li>
<li>14.2.K</li>
<li>Which line bundles on \(\mathbb P^n_k\) are globally generated?</li>
<li>Let \(f \colon \mathbb P^1_k \to \mathbb P^n_k\) be a map such that \(f^*O(1) = O(d)\). Suppose \(d < n\). Prove that the image of \(f\) must lie on a hyperplane.</li>
<li>Prove that the automorphism group of \(P^n_k\) is the group \(PGL_{n+1}(k)\).</li>
</ul></li>
</ol>
</div>
</div>


<div id="outline-container-org4fff7a3" class="outline-3">
<h3 id="org4fff7a3" class="collapsible">Midterm exam</h3>
<div class="outline-text-3" id="text-org4fff7a3">
<p>
The midterm exam will be an oral exam in the week of September 21. It will be about 45 minutes long. I have prepared <a href="midterm1.pdf">a list of questions for the exam</a>. We will ask questions from this list, small variations on them, and follow up questions based on your responses.
</p>
</div>
</div>


<div id="outline-container-orgda83b7b" class="outline-3">
<h3 id="orgda83b7b" class="collapsible">Final exam</h3>
<div class="outline-text-3" id="text-orgda83b7b">
</div>
<ul class="org-ul">
<li><a id="orge5d4b24"></a>Practice questions<br />
<div class="outline-text-5" id="text-orge5d4b24">
<ol class="org-ol">
<li>Let \(X\) be a Noetherian scheme.
<ul class="org-ul">
<li>Give the definition of a quasi-coherent sheaf on \(X\).</li>
<li>Give an example of a quasi-coherent sheaf that is not coherent.</li>
<li>Give an example of a coherent sheaf that is not locally free.</li>
<li>Is a subsheaf of a locally free sheaf necessarily locally free?</li>
<li>Suppose \(F\) is a coherent sheaf such that the stalks \(F_x\) are free for all (closed) points \(x\). Must \(F\) be free? Locally free?</li>
</ul></li>

<li>Let \(X = {\rm Spec}\ A\).
<ul class="org-ul">
<li>Explain the relationship between closed subschemes of \(X\) and ideals of \(A\).</li>
<li>Let \(Y \to X\) and \(Z \to X\) be closed embeddings. Is \(Y \times_X Z \to X\) also a closed embedding? What if \(X\) is not affine? What about open embeddings?</li>
</ul></li>

<li>Let \(X = {\rm Proj}\ \mathbb Q[X,Y,Z]/(X^2+Y^2+Z^2)\).
<ul class="org-ul">
<li>Is there a map \({\rm Spec}\ \mathbb Q \to X\)?</li>
<li>Prove that \(X \times {\rm Spec}\ \mathbb C\) is isomorphic to \(\mathbb P^1_{\mathbb C}\).</li>
<li>Is \(X\) isomorphic to \(\mathbb P^1_{\mathbb Q}\)?</li>
<li>Describe a closed embedding of \(X \times X\) in \(\mathbb P^n_{\mathbb Z}\) for some \(n\).</li>
</ul></li>

<li>Let \(X = \mathbb P^1_\mathbb C\). Let \(p = [0:1]\) and \(q = [1:0]\).
<ul class="org-ul">
<li>Describe the sheaf \(O(p-q)\).</li>
<li>Is this quasi-coherent? Coherent? Locally free?</li>
<li>What more can you say about it?</li>
<li>What if I had taken a different linear combination of a different set of points?</li>
</ul></li>

<li>Everything in this question is over a field \(k\).
<ul class="org-ul">
<li>What is the Picard group of \(\mathbb P^n\)?</li>
<li>What about \(\mathbb P^n \times \mathbb P^m\)?</li>
<li>Let \(L = \pi_1^* O(a) \otimes \pi_2^* O(b)\) on \(\mathbb P^1 \times \mathbb P^1\). For which \(a\) and \(b\) does \(L\) have a global section? is globally generated?</li>
<li>Describe some global sections of \(L\) when \(a = 1\) and \(b = 1\).</li>
<li>Do the sections you wrote define a map to a projective space?</li>
<li>What is the nature of this map? (Finite, open embedding, closed embedding, constant)?</li>
</ul></li>

<li>Let \(X = \mathbb P^2_k\).
<ul class="org-ul">
<li>What is the Euler characteristic of the structure sheaf of \(m\) points?</li>
<li>What is the Euler characteristic of the ideal sheaf of \(m\) points?</li>
<li>Let \(I\) be the ideal sheaf of \(6\) points. Using the short exact sequence on cohomology, can you make a guess about the dimension of \(H^i(I)\)? What about \(H^i(I(n))\)? Should these numbers be the same for all configurations of the points?</li>
</ul></li>
</ol>
</div>


<ul class="org-ul">
<li><a id="org3930d34"></a>Marking<br />
<div class="outline-text-6" id="text-org3930d34">
<p>
Five major areas. Each out of 10.
</p>

<ol class="org-ol">
<li>Quasi-coherent and coherent sheaves, stalks, fibers, support.</li>
<li>Local freeness, kernels/cokernels, pull-backs, push-forwards.</li>
<li>Open and closed embeddings, fiber products.</li>
<li>Line bundles, divisors, maps to projective space.</li>
<li>Global sections, cohomology, Euler characteristic.</li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgb345e35" class="outline-2">
<h2 id="orgb345e35" class="collapsible">Weekly reading, viewing, and doing</h2>
<div class="outline-text-2" id="text-orgb345e35">
<p>
&ldquo;Do&rdquo; does not mean &ldquo;write up and submit&rdquo;. 
A general convention in Ravi&rsquo;s book is that ⋆ indicates an advanced section that can be skipped on the first reading.
</p>
</div>

<div id="outline-container-org063c7d5" class="outline-3">
<h3 id="org063c7d5" class="collapsible">Week 12</h3>
<div class="outline-text-3" id="text-org063c7d5">
<ul class="org-ul">
<li><b><b>Read/skim</b></b>: 18.1, 18.2, 18.3, 18.4</li>
<li><b><b>Do</b></b>: 
<ul class="org-ul">
<li>Exercise 18.3.A</li>
<li>Exercise 18.4.A</li>
<li>Exercise 18.4.B/C (maybe)</li>
</ul></li>
<li><b><b>Watch</b></b>
<ol class="org-ol">
<li><a href="https://vimeo.com/470803503">Sheaf cohomology</a></li>
<li><a href="https://vimeo.com/470835362">Cohomology of quasicoherent sheaves</a></li>
<li><a href="https://vimeo.com/472058119">Cech cohomology and the Picard group</a></li>
</ol></li>
</ul>
</div>

<ul class="org-ul">
