content/teaching/schemes/index.org
**** Thursday

1.  Let \(\pi \colon X \to Y\) be an affine morphism and \(F\) a quasi-coherent sheaf on \(X\).
   -   Prove that \(H^i(X, F) = H^i(Y, \pi_* F)\).
   -   In particular, if \(\pi\) is a closed embedding, "treating \(F\) as a sheaf on \(Y\)" does not change the cohomology.

2.  Compute the cohomology group \(H^1(\mathbb A^2 - \{(0,0)\}, O)\).

3.  Let \(X \subset \mathbb P^1_k\) be a finite set of \(m\) points.
   -   Show that we have an exact sequence \(0 \to O(-m) \to O \to O_X \to 0\).
     (Standard abuse of notation: writing \(O_X\) for \(i_* O_X\) where \(i\) is the closed embedding.)
   -   Use this and \(h^1(\mathbb P^1, O) = 0\) to find \(h^1(\mathbb P^1, \O(-m))\).

4.  Let \(X \subset \mathbb P^2_k\) be a curve of degree \(d\). That is, \(X = V(F)\), where \(F\) is a section of \(O(d)\).
   -   Show that we have an exact sequence \(0 \to O(-d) \to O \to O_X \to 0.\) What is the first map in this sequence?
   -   Find the Euler characteristic of \(O_X\).
   -   The genus of a curve \(X\) is defined to be \(1 - \chi(O_X)\). Find the genus of a curve of degree \(d\) in \(\mathbb P^2_k\).
     (For smooth connected curves, this is the same as \(h^1(O_X)\). Over \(\mathbb C\), this agrees with the topological genus.)

5.  Assume the Hilbert Syzygy Theorem: every coherent sheaf \(F\) on \(\mathbb P^n\) has a finite resolution whose terms are direct sums of line bundles.
    
   -   Prove that \(n \mapsto \chi F (n)\) is a polynomial function of \(n\). This is called the "Hilbert polynomial" of \(F\).
   -   Prove that \(n \mapsto h^0(F(n))\), called the "Hilbert function", agrees with the Hilbert polynomial for all sufficiently large \(n\). (Hint: Serre vanishing).

     (There is a more direct inductive proof of polynomiality using slicing by hyperplanes.)


** Week 11
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   **Read**: 16.1, 16.2, 16.3, 16.4 (which uses bits from 15.3.3), 16.5 (take S = spec k), skim the rest of 16.
-   **Notes**:
  -   The main section I want you to understand is 16.4. It describes all maps from an X to a projective space. As a result, it describes all maps from X to a quasi-projective variety Y. Since almost all schemes we care about are quasi-projective, this explains why we care so much about line bundles.
  -   16.3 (the construction of the pull-back) is long for the same reasons that the section on fibered products was long. Everything is easy over affines, but it takes some space to carry out the gluing. I suggest going over this section lightly, perhaps only focusing on the affine case, and believing that gluing works.
-   **More**:
  -   Cech cohomology, for example start skimming Chapter 18.
    I may add more references or make my own video/notes.


*** Thursday

1.  Prove that pullback of a locally free sheaf is locally free (of the same rank).

2.  (15.3.F) Vitally important construction!

3.  Read 16.4.1 (Important Theorem) and its proof.

4.  Let \(\mathbb P^n \to \mathbb P^n\) be the identity map. What is the line bundle and the sections corresponding to this map?

5.  Show that the automorphism group of \(\mathbb P^1_k\) is \(PGL_2(k)\).

6.  Let \(p \in \mathbb P^2\) be a point. Recall we have a linear projection \(\mathbb P^2 - \{p\} \to \mathbb P^1\). Which line bundle and sections give this map?

7.  Find the divisor class group (= Picard group) of the blow-up of \(\mathbb A^2\) at \((0,0)\).


*** Friday

1.  Show that a map \(X \to \mathbb P^n\) is the same as a line bundle \(L\) on \(X\) and a surjective map \(O_X^{n+1} \to L.\)
    
   Suppose for simplicity that we are working over an algebraically closed field \(k\). I claim that the above statement is a precise version of: \(\mathbb P^n_k\) is the space of one-dimensional quotients of \(k^{n+1}\). Can you justify this claim?
   Hint: Take \(X = {\rm Spec}\ k\) to get a description of closed points of \(\mathbb P^n_k\).

2.  Read theorem 16.5.1 (take the base S = Spec k, for simplicity) and its proof (16.5.2)
   As an example, consider the map \({\rm Spec}\ \mathbb Z \dashrightarrow \mathbb P^1_\mathbb Z\) "defined by" \([6:12]\). On which open set is this map defined? Extend it to all of \({\rm Spec}\ \mathbb Z\).

3.  (15.3.C: Globally generated sheaves. Assume X Noetherian)

4.  Read Serre's theorem A (15.3.8) and its consequence (15.3.1)

5.  Let \(I\) be the ideal sheaf of a point in \(\mathbb P^2_k\). Is \(I\) globally generated? Find an \(n\) such that \(I(n)\) is globally generated.

6.  Read the Hilbert Syzygy Theorem (15.3.2)


** Week 10
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   **Read**: Chapter 14 and chapter 12.5 for background
-   **Notes**:
  -   14.1 should be straightforward (and will get your hands dirty).
  -   14.2 is dense and challenging. But it is extremely important in algebraic geometry (and in algebraic number theory!).
  -   We have not read all the pre-requisites for this section, but you should attempt to read it anyway, taking on faith some things from previous section. Here are some pointers:
  -   Restrict to Noetherian integral schemes.
  -   There is some algebra that is necessary. The main ideas are
  -   Dimension = Krull dimension = max of the length of a chain of prime ideals. This could be infinite, but assume it is finite.
  -   Let \(Y \subset X\) be irreducible of codimension \(r\). Let \(p\) be the generic point of \(Y\), then the Krull dimension of \(O_{X,p}\) is \(r\). In particular, if \(r = 1\), then \(O_{X,p}\) has dimension 1.
  -   If \(X\) is "regular in codimension 1" then \(O_{X,p}\) is regular local of dimension 1, and hence a Discrete Valuation Ring (DVR). See 12.5. DVRs allow us to measure "order of vanishing" of a function, which is essential for divisor theory.
    Regular in codimension 1 is equivalent to "singular locus of \(X\) has codimension 2 or higher". So, not too singular.
  -   For divisor theory, it is important to work with normal \(X\). The normality condition appears to be purely algebraic (integrally closed), but has two important geometric consequences: (1) Normal implies regular in codimension 1 (2) Hartog's lemma holds: if a rational function \(f\) has no poles (in codimension 1), then \(f\) is regular.


