docs/teaching/schemes/index.html
<li><a id="org9e4dbf8"></a>Thursday<br />
<div class="outline-text-5" id="text-org9e4dbf8">
<ol class="org-ol">
<li>Let \(\pi \colon X \to Y\) be an affine morphism and \(F\) a quasi-coherent sheaf on \(X\).
<ul class="org-ul">
<li>Prove that \(H^i(X, F) = H^i(Y, \pi_* F)\).</li>
<li>In particular, if \(\pi\) is a closed embedding, &ldquo;treating \(F\) as a sheaf on \(Y\)&rdquo; does not change the cohomology.</li>
</ul></li>

<li>Compute the cohomology group \(H^1(\mathbb A^2 - \{(0,0)\}, O)\).</li>

<li>Let \(X \subset \mathbb P^1_k\) be a finite set of \(m\) points.
<ul class="org-ul">
<li>Show that we have an exact sequence \(0 \to O(-m) \to O \to O_X \to 0\).
(Standard abuse of notation: writing \(O_X\) for \(i_* O_X\) where \(i\) is the closed embedding.)</li>
<li>Use this and \(h^1(\mathbb P^1, O) = 0\) to find \(h^1(\mathbb P^1, \O(-m))\).</li>
</ul></li>

<li>Let \(X \subset \mathbb P^2_k\) be a curve of degree \(d\). That is, \(X = V(F)\), where \(F\) is a section of \(O(d)\).
<ul class="org-ul">
<li>Show that we have an exact sequence \(0 \to O(-d) \to O \to O_X \to 0.\) What is the first map in this sequence?</li>
<li>Find the Euler characteristic of \(O_X\).</li>
<li>The genus of a curve \(X\) is defined to be \(1 - \chi(O_X)\). Find the genus of a curve of degree \(d\) in \(\mathbb P^2_k\).
(For smooth connected curves, this is the same as \(h^1(O_X)\). Over \(\mathbb C\), this agrees with the topological genus.)</li>
</ul></li>

<li>Assume the Hilbert Syzygy Theorem: every coherent sheaf \(F\) on \(\mathbb P^n\) has a finite resolution whose terms are direct sums of line bundles.

<ul class="org-ul">
<li>Prove that \(n \mapsto \chi F (n)\) is a polynomial function of \(n\). This is called the &ldquo;Hilbert polynomial&rdquo; of \(F\).</li>
<li><p>
Prove that \(n \mapsto h^0(F(n))\), called the &ldquo;Hilbert function&rdquo;, agrees with the Hilbert polynomial for all sufficiently large \(n\). (Hint: Serre vanishing).
</p>

<p>
(There is a more direct inductive proof of polynomiality using slicing by hyperplanes.)
</p></li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgd253eb9" class="outline-3">
<h3 id="orgd253eb9" class="collapsible">Week 11</h3>
<div class="outline-text-3" id="text-orgd253eb9">
<ul class="org-ul">
<li><b><b>Read</b></b>: 16.1, 16.2, 16.3, 16.4 (which uses bits from 15.3.3), 16.5 (take S = spec k), skim the rest of 16.</li>
<li><b><b>Notes</b></b>:
<ul class="org-ul">
<li>The main section I want you to understand is 16.4. It describes all maps from an X to a projective space. As a result, it describes all maps from X to a quasi-projective variety Y. Since almost all schemes we care about are quasi-projective, this explains why we care so much about line bundles.</li>
<li>16.3 (the construction of the pull-back) is long for the same reasons that the section on fibered products was long. Everything is easy over affines, but it takes some space to carry out the gluing. I suggest going over this section lightly, perhaps only focusing on the affine case, and believing that gluing works.</li>
</ul></li>
<li><b><b>More</b></b>:
<ul class="org-ul">
<li>Cech cohomology, for example start skimming Chapter 18.
I may add more references or make my own video/notes.</li>
</ul></li>
</ul>
</div>


<div id="outline-container-org9decfaf" class="outline-4">
<h4 id="org9decfaf">Thursday</h4>
<div class="outline-text-4" id="text-org9decfaf">
<ol class="org-ol">
<li>Prove that pullback of a locally free sheaf is locally free (of the same rank).</li>

<li>(15.3.F) Vitally important construction!</li>

<li>Read 16.4.1 (Important Theorem) and its proof.</li>

<li>Let \(\mathbb P^n \to \mathbb P^n\) be the identity map. What is the line bundle and the sections corresponding to this map?</li>

<li>Show that the automorphism group of \(\mathbb P^1_k\) is \(PGL_2(k)\).</li>

<li>Let \(p \in \mathbb P^2\) be a point. Recall we have a linear projection \(\mathbb P^2 - \{p\} \to \mathbb P^1\). Which line bundle and sections give this map?</li>

<li>Find the divisor class group (= Picard group) of the blow-up of \(\mathbb A^2\) at \((0,0)\).</li>
</ol>
</div>
</div>


<div id="outline-container-orgd86d53a" class="outline-4">
<h4 id="orgd86d53a">Friday</h4>
<div class="outline-text-4" id="text-orgd86d53a">
<ol class="org-ol">
<li><p>
Show that a map \(X \to \mathbb P^n\) is the same as a line bundle \(L\) on \(X\) and a surjective map \(O_X^{n+1} \to L.\)
</p>

<p>
Suppose for simplicity that we are working over an algebraically closed field \(k\). I claim that the above statement is a precise version of: \(\mathbb P^n_k\) is the space of one-dimensional quotients of \(k^{n+1}\). Can you justify this claim?
Hint: Take \(X = {\rm Spec}\ k\) to get a description of closed points of \(\mathbb P^n_k\).
</p></li>

<li>Read theorem 16.5.1 (take the base S = Spec k, for simplicity) and its proof (16.5.2)
As an example, consider the map \({\rm Spec}\ \mathbb Z \dashrightarrow \mathbb P^1_\mathbb Z\) &ldquo;defined by&rdquo; \([6:12]\). On which open set is this map defined? Extend it to all of \({\rm Spec}\ \mathbb Z\).</li>

<li>(15.3.C: Globally generated sheaves. Assume X Noetherian)</li>

<li>Read Serre&rsquo;s theorem A (15.3.8) and its consequence (15.3.1)</li>

<li>Let \(I\) be the ideal sheaf of a point in \(\mathbb P^2_k\). Is \(I\) globally generated? Find an \(n\) such that \(I(n)\) is globally generated.</li>

<li>Read the Hilbert Syzygy Theorem (15.3.2)</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgd6f884c" class="outline-3">
<h3 id="orgd6f884c" class="collapsible">Week 10</h3>
<div class="outline-text-3" id="text-orgd6f884c">
<ul class="org-ul">
<li><b><b>Read</b></b>: Chapter 14 and chapter 12.5 for background</li>
<li><b><b>Notes</b></b>:
<ul class="org-ul">
<li>14.1 should be straightforward (and will get your hands dirty).</li>
<li>14.2 is dense and challenging. But it is extremely important in algebraic geometry (and in algebraic number theory!).</li>
<li>We have not read all the pre-requisites for this section, but you should attempt to read it anyway, taking on faith some things from previous section. Here are some pointers:</li>
<li>Restrict to Noetherian integral schemes.</li>
<li>There is some algebra that is necessary. The main ideas are</li>
<li>Dimension = Krull dimension = max of the length of a chain of prime ideals. This could be infinite, but assume it is finite.</li>
<li>Let \(Y \subset X\) be irreducible of codimension \(r\). Let \(p\) be the generic point of \(Y\), then the Krull dimension of \(O_{X,p}\) is \(r\). In particular, if \(r = 1\), then \(O_{X,p}\) has dimension 1.</li>
<li>If \(X\) is &ldquo;regular in codimension 1&rdquo; then \(O_{X,p}\) is regular local of dimension 1, and hence a Discrete Valuation Ring (DVR). See 12.5. DVRs allow us to measure &ldquo;order of vanishing&rdquo; of a function, which is essential for divisor theory.
Regular in codimension 1 is equivalent to &ldquo;singular locus of \(X\) has codimension 2 or higher&rdquo;. So, not too singular.</li>
<li>For divisor theory, it is important to work with normal \(X\). The normality condition appears to be purely algebraic (integrally closed), but has two important geometric consequences: (1) Normal implies regular in codimension 1 (2) Hartog&rsquo;s lemma holds: if a rational function \(f\) has no poles (in codimension 1), then \(f\) is regular.</li>
</ul></li>
</ul>
</div>
