content/teaching/schemes/index.org
*** Discussions

1.  Thursday

   1.  (14.1.A)
      Show that the space of global sections of \(O(n)\) on \(\mathbb P^1_k = {\rm Proj}\ k[X,Y]\) is naturally isomorphic to \(k[X,Y]_n\), the degree \(n\) graded component of \(k[X,Y]\).

   2.  Let \(s = X^2Y(X + Y)\), considered as a global section of \(O(4)\) on \(\mathbb P^1_{\mathbb C}\). Find \({\rm div} (s)\).

   3.  Let \(s = \frac{101}{100}\), considered as a rational section of \(O\) on \({\rm Spec}\ \mathbb Z\).
      Find \({\rm div} (s)\).

   4.  Choose one of \(X = {\rm Spec}\ \mathbb Z\) or \(X = {\rm Spec}\ \mathbb A^1_k\).
      Identify the group of \(\{(L,s)\}\)/isomorphism.

   5.  Understand the proof of 14.2.1: \({\rm div}\) is injective on normal (Noetherian) \(X\).

   6.  (14.1.D)
      Sketch a proof of the fact that \({\rm Pic} \mathbb P^1_k = \mathbb Z\).
      Hint: The only invertible sheaf on \(\mathbb A^1\) is the trivial one.

   7.  Failure of Hartog's lemma.
      Let us construct an \(X\) that is regular in codimension 1, but not normal. \(X\) can't be a curve (why?). So let us try a surface. We take a regular surface and modify it only in codimension 2 and hope to break normality. 

      Start with \(Y = \mathbb A^2\). Obtain \(X\) by gluing two distinct points of \(X\), say \(p = (1,0)\) and \(q = (0,1)\) 

      -   Can you make this precise? Hint: this is an affine variety, so try to first construct the ring of functions, and then take the spec.
      -   Take any function \(f\) on \(\mathbb A^2\) with distinct values at \(p\) and \(q\), for example \(x-y\). Then \(f\) is a rational function on \(X\) that has no poles (\({\rm div} f = 0\)) but is not regular.

2.  Friday

   1.  (Example of 14.2.E)
      Let \(D = 3[0] - [\infty]\) on \(X = \mathbb P^1\). Show that \(O_X(D)\) is an invertible sheaf. Show that it is isomorphic to \(O(2)\).
   2.  (14.2.E)
      Spend some time on the general result: For \((L,s)\), we have \(O(div s) \cong L\).
   3.  (14.2.7)
      Digest the diagram in 14.2.7.
   4.  (14.2.5)
      Prove that if \(D\) is locally principal, then \(O_X(D)\) is invertible.
   5.  (14.2.I)
      For a factorial \(X\), every divisor is locally principal.
   6.  Prove (using the divisor class group) that \({\rm Pic} \mathbb P^n_k = \mathbb Z\).
   7.  Prove (using the divisor class group) that \({\rm Pic} \mathbb P^1_k \times \mathbb P^1_k = \mathbb Z \oplus \mathbb Z\).
   8.  (14.2.K) Pic of the complement of a hypersurface.


** Week 9
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   **Read**: Chapter 13
-   **Important points**
  -   The upshot of this chapter is: a quasi-coherent sheaf is to a scheme what a module is to a ring.
  -   Section 13.1 is for motivation. It talks about locally free sheaves, which are the most important quasi-coherent sheaves. On the first reading, skip the proof of 13.2.1.
  -   In 13.3, the main theorem (13.3.2) is basically a repeat of the sheaves = sheaves on a base fact.
  -   Do 13.3.D, 13.3.F, 13.3.G, 13.3.H, 13.4.A.
  -   Skip all the starred sections.
-   **Watch**: I think we are beyond the pseudo-lectures because we skipped some chapters :(


*** Discussions

1.  Thursday

   Choose your adventure.
    
   Let \(k\) be an algebraically closed field.
    
   1.  Let \(X = \mathbb A^1_k\) and let \(p \in X\) be any closed point. Let \(I_p \subset O_X\) be the ideal sheaf of \(p\).
      1.  Describe explicitly the module \(I_p(U)\) for every open \(U \subset X\).
      2.  Prove that \(I_p\) is locally free of rank 1.
      3.  Now take \(X = \mathbb P^1_k\) and define \(I_p\) as before. What are the global sections of \(I_p\)? That is, find \(\Gamma(X, I_p)\).
      4.  What is the cokernel of the map \(I_p \to O_X\)?
      5.  Give examples of 
         -   a coherent sheaf on \(X\) that is not locally free
         -   a quasi-coherent sheaf on \(X\) that is not coherent
      6.  Let \(X = {\rm Spec}\ k[x,y]/(xy)\) and \(p = (0,0)\). Show that the ideal sheaf \(I_p\) is not locally free. Is it quasi-coherent? Coherent?

   2.  Let \(i \colon U \to X\) be the open inclusion \(\mathbb A^1 \to \mathbb P^1\).
      1.  Prove that \(i_* O_U\) is a quasi-coherent \(O_X\)-module. (Appealing to a general theorem is OK).
      2.  Is \(i_* O_U\) coherent?
      3.  What is the pushfoward look like for \(f \colon {\rm Spec}\ A \to {\rm Spec}\ B\)?
      4.  Prove the general theorem alluded to above (13.3.F)

   3.  Let \(X = {\rm Proj}\ k[u,v][X,Y]/(vX-uY) \subset \mathbb A^2 \times \mathbb P^1\).
      Prove that \(\pi \colon X \to \mathbb P^1\) is a line bundle. That is:
      1.  Construct an open cover \(U_i\) of \(\mathbb P^1\) and isomorphisms \(\pi^{-1} U_i \cong U_i \times \mathbb A^1\).
         (The standard open cover will work.)
      2.  Find the transition function(s) \(U_i \cap U_j \times \mathbb A^1 \to U_i \cap U_j \times \mathbb A^1\) and show that they are linear in the \(\mathbb A^1\) coordinate.
         (The linearity ensures that the fibers of \(\pi\) get a consistent vector space structure.)
      3.  Let \(I\) be the sheaf of sections of \(\pi\). Then \(I\) is locally free of rank 1.
         Find the global sections of \(I\).
      4.  What are the transitions functions of the dual \(I^\vee\)?
      5.  What are the global sections of \(I^\vee\)?

2.  Friday

   Adventure continued. But also:
    
   1.  Stalks and fibers

      Remark: A good (but not perfect) way to think about a sheaf \(F\) is as a collection of stalks \(F_p\) (which are modules).

      If \(F\) is (quasi)-coherent, an even simpler (but more imperfect) approximation is as a collection of fibers \(F|_p\) (which are vector spaces).

      Let \(F\) be a coherent sheaf on a locally Noetherian \(X\). What can be gleaned from the fibers?

      1.  Let \(M = k[t]/(t-1)(t+1)\) and  \(F = \widetilde M\) on \(X = \mathbb A^1_k = {\rm Spec}\ k[t] \).
         What are the stalks of \(M\) at every point of \(X\)?
         What are the fibers of \(M\) at every point of \(X\)? (Including the generic point).

      2.  If \(F|_p = 0\), then \(F_p = 0\), and there exists an open neighborhood of \(p\) on which \(F = 0\).
      3.  \(F \to G\) is surjective on fibers if and only if it is surjective. If \(F|_p \to G|_p\) is surjective, then \(F \to G\) is surjective in a neighborhood of \(p\).
         What can you say about injectivity?
      4.  If \(s_1, &#x2026;, s_n\) are are sections of \(F\) that generate \(F|_p\), then they generate \(F|_q\) for every \(q\) in a neighborhood of \(p\).
      5.  The function \(p \mapsto dim(F|_p)\) is upper semicontinuous.
      6.  If \(X\) is reduced and connected, then \(F\) is locally free if and only if the rank function is constant.
      7.  Give an example where the above fails for non-reduced \(X\).
      8.  Let \(X = \mathbb A^2\) and \(I\) the ideal sheaf of \((0,0)\). Compute the rank function for \(I\).


