content/teaching/schemes/index.org
** Week 8
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   **Read**: [[http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf][Chapter 9]]
-   **Watch**: [[https://www.youtube.com/watch?v=RuFBNbR1XN0][AGITTOC Pseudolecture 11]]
-   **Important points**
  -   You should spend most of your time on 9.2 and 9.3.
  -   Do not get bogged down by the proof of the existence of fibered products (Theorem 9.1.1). The important points to understand are:
    -   Fibered products of affines (9.1.B).
    -   The general case is by gluing the affine case (first paragraph of the proof of 9.1.1).
  -   Skip 9.1.6, 9.3.7, 9.4, and 9.5.
  -   Go lightly over 9.3.6, and read 9.7 only if you have time.
  -   Most of section 9.6 should feel familiar.


*** Discussion

1.  Thursday

   1.  9.1.B (Fibered products of affines = tensor product of rings)

   2.  Consider \(f \colon Y = {\rm Spec}\ \mathbb C[y] \to {\rm Spec}\ \mathbb C[x] = X\) induced by \(x \mapsto y^2\).
      Let \(p \colon {\rm Spec}\ \mathbb C \to X\) be the closed embedding of a point.
      The (scheme-theoretic) preimage of \(p\) is the closed embedding \(p \times_X Y \to Y\).
      Find the preimages of the point \(x = 0\) and \(x = a\) for \(a \neq 0\).

      Draw a picture.

   3.  Consider \(f \colon Y = {\rm Spec}\ \mathbb Q[y] \to {\rm Spec}\ \mathbb Q[x] = X\) induced by \(x \mapsto y^2\).
      Find the scheme-theoretic preimages of 

      1.  \(p \colon {\rm Spec}\ \mathbb Q \to Y\) given by \(y \mapsto 0\).
      2.  \(p \colon {\rm Spec}\ \mathbb Q \to Y\) given by \(y \mapsto 1\).
      3.  \(p \colon {\rm Spec}\ \mathbb Q \to Y\) given by \(y \mapsto 2\).

         Try drawing a picture.

   4.  Consider \(f \colon Y = {\rm Spec}\ \mathbb Z[i] \to {\rm Spec}\ \mathbb Z = X\).
      Find the scheme-theoretic preimages of the points (2), (3), and (5).
      Try drawing a picture.

   5.  9.2.C (a) (Intersection as fibered product)

   6.  A "geometric point" of a scheme \(X\) is a map \({\rm Spec}\ k \to X\), where \(k\) is algebraically closed.
      Show that the fibers of \(f \colon Y = {\rm Spec}\ \mathbb Q[y] \to {\rm Spec}\ \mathbb Q[x] = X\) over geometric points are either a pair of distinct points or a non-reduced (double) point.

2.  Friday

   . . . the end of all our exploring
   Will be to arrive where we started
   And know the place for the first time.
    
   &#x2013; T. S. Eliot, “Little Gidding” (Four Quartets)
    
   1.  9.3.F (The blowup, again)
      Can you reconcile our previous description as \({\rm Proj}\ k[x,y][u,v]/(xv-yu)\) with Ravi's definition?
   2.  Show that the following properties are preserved under base change:
      1.  open embedding
      2.  closed embedding
      3.  affine
      4.  finite (affine + finite as a module) (optional)
   3.  9.6.1 (Check that the Segre embedding is a closed embedding)
   4.  9.6.B (Equations of the Segre embedding)
   5.  6.4.A, 6.4.B (Maps of graded rings and Proj)
      But NOT all maps of Proj are of this form!
   6.  6.4.D (Veronese)
   7.  6.4.F


** Week 7
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   **Read:** -   Sections 5.1 and 5.2
  -   Sections 6.1, 6.2, 6.3,
  -   Sections 7.1, 8.1

-   **Important points:**
  -   **5.1, 5.2:** Learn the adjectives: irreducible, Noetherian, reduced, integral. Do 5.2.F (integral = reduced + irreducible).
  -   **6.1, 6.2, 6.3:** This seems long, but it's mostly discursive, trying to motivate the right definition of a morphism. The upshot is 6.2.2, which is more important than the technical definition in 6.3. Do 6.3.C to nail down your understanding. Highly recommended - 6.3.E, 6.3.F. Go lightly over 6.3.9 and later.
  -   **7.1 (open embeddings):** These are uncomplicated, so this should be easy.
  -   **8.1 (closed embeddings):** There is an initial learning curve here (but eventually, they become as easy as open embeddings). Learn about the ideal sheaf. Recommended: 8.1.C, 8.1.D, 8.1.E, 8.1.J.


*** Discussion

1.  Thursday

   1.  6.3.B
      For affines, morphism of locally ringed spaces = induced by a ring map
   2.  6.3.A
      Morphisms glue
   3.  6.3.C
      Morphism is locally induced by ring maps
   4.  6.3.F
      Morphism to Spec A
   5.  6.3.I
      Spec Z is final
   6.  6.3.H
      Structure map of Proj
   7.  6.3.J
      Map from a point
   8.  6.3.M
      (Some) morphisms to projective space

2.  Friday

   \({\mathbf A}^{n} = Spec Z[x_{1},\dots, x_{n}]\). \({\mathbf P}^{n} = Proj Z[X_{0}, \dots, X_{n}]\)
    
   1.  A different take on 6.3.M
      -   Construct a morphism \(\mathbf{A}^{{n+1}} - 0 \to \mathbf{P}^{n}\).
      -   Show that a morphism \(X \to \mathbf{A}^{{n+1}} - 0\) is the same as \(n+1\) global sections \(f_{0}, \dots f_{n}\) of \(O_{X}\) that do not have a common zero.
      -   Conclude that such \(f_{i}\) give a map \(X \to \mathbf{P}^{n}\).
      -   You now see why all maps \(X \to \mathbf{P}^{n}\) may not arise in this way.

   2.  Make sense of the map \(\mathbf{P}^{1} \to \mathbf{P}^{2}\) "defined by \([X^{2}:XY:Y^{2}]\)"

   3.  8.1.D (Use 7.3.4 - being affine is affine local on the target).
      Closed embeddings = maps which locally Spec(A/I) -> Spec A

   4.  Let p be a point of X.
      Show that the natural map Spec k(p) -> X is a closed embedding if and only if p is a closed point.

   5.  Show that the map in (2) "\([X^{2}:XY:Y^{2}]\)" is a closed embedding.

   6.  Generalise (2) for the "rational normal curve": \(\mathbf{P}^{1} \to \mathbf{P}^{n}\) given by \([X^{n}:X^{n-1}Y:\dots:Y^{n}]\).

   7.  Describe the sheaf of ideals in (4) if p is a closed point.

   8.  Read 8.1.H and be convinced that this should work.

   9.  Let S be a graded ring and I &sub; S a homogeneous ideal.
      Construct a map Proj(S/I) -> Proj(S) and show that it is a closed embedding.

   10. Is the map Spec C[t] -> Spec C[x,y] "given by \((t^{2},t^{3})\)" a closed embedding? A homeomorphism onto its image?


