docs/teaching/schemes/index.html


<div id="outline-container-orgbeb3f2c" class="outline-3">
<h3 id="orgbeb3f2c" class="collapsible">Week 8</h3>
<div class="outline-text-3" id="text-orgbeb3f2c">
<ul class="org-ul">
<li><b><b>Read</b></b>: <a href="http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf">Chapter 9</a></li>
<li><b><b>Watch</b></b>: <a href="https://www.youtube.com/watch?v=RuFBNbR1XN0">AGITTOC Pseudolecture 11</a></li>
<li><b><b>Important points</b></b>
<ul class="org-ul">
<li>You should spend most of your time on 9.2 and 9.3.</li>
<li>Do not get bogged down by the proof of the existence of fibered products (Theorem 9.1.1). The important points to understand are:
<ul class="org-ul">
<li>Fibered products of affines (9.1.B).</li>
<li>The general case is by gluing the affine case (first paragraph of the proof of 9.1.1).</li>
</ul></li>
<li>Skip 9.1.6, 9.3.7, 9.4, and 9.5.</li>
<li>Go lightly over 9.3.6, and read 9.7 only if you have time.</li>
<li>Most of section 9.6 should feel familiar.</li>
</ul></li>
</ul>
</div>


<div id="outline-container-org226ad86" class="outline-4">
<h4 id="org226ad86">Discussion</h4>
<div class="outline-text-4" id="text-org226ad86">
<ol class="org-ol">
<li>Thursday

<ol class="org-ol">
<li>9.1.B (Fibered products of affines = tensor product of rings)</li>

<li><p>
Consider \(f \colon Y = {\rm Spec}\ \mathbb C[y] \to {\rm Spec}\ \mathbb C[x] = X\) induced by \(x \mapsto y^2\).
Let \(p \colon {\rm Spec}\ \mathbb C \to X\) be the closed embedding of a point.
The (scheme-theoretic) preimage of \(p\) is the closed embedding \(p \times_X Y \to Y\).
Find the preimages of the point \(x = 0\) and \(x = a\) for \(a \neq 0\).
</p>

<p>
Draw a picture.
</p></li>

<li>Consider \(f \colon Y = {\rm Spec}\ \mathbb Q[y] \to {\rm Spec}\ \mathbb Q[x] = X\) induced by \(x \mapsto y^2\).
Find the scheme-theoretic preimages of 

<ol class="org-ol">
<li>\(p \colon {\rm Spec}\ \mathbb Q \to Y\) given by \(y \mapsto 0\).</li>
<li>\(p \colon {\rm Spec}\ \mathbb Q \to Y\) given by \(y \mapsto 1\).</li>
<li><p>
\(p \colon {\rm Spec}\ \mathbb Q \to Y\) given by \(y \mapsto 2\).
</p>

<p>
Try drawing a picture.
</p></li>
</ol></li>

<li>Consider \(f \colon Y = {\rm Spec}\ \mathbb Z[i] \to {\rm Spec}\ \mathbb Z = X\).
Find the scheme-theoretic preimages of the points (2), (3), and (5).
Try drawing a picture.</li>

<li>9.2.C (a) (Intersection as fibered product)</li>

<li>A &ldquo;geometric point&rdquo; of a scheme \(X\) is a map \({\rm Spec}\ k \to X\), where \(k\) is algebraically closed.
Show that the fibers of \(f \colon Y = {\rm Spec}\ \mathbb Q[y] \to {\rm Spec}\ \mathbb Q[x] = X\) over geometric points are either a pair of distinct points or a non-reduced (double) point.</li>
</ol></li>

<li><p>
Friday
</p>

<p>
. . . the end of all our exploring
Will be to arrive where we started
And know the place for the first time.
</p>

<p>
&amp;#x2013; T. S. Eliot, “Little Gidding” (Four Quartets)
</p>

<ol class="org-ol">
<li>9.3.F (The blowup, again)
Can you reconcile our previous description as \({\rm Proj}\ k[x,y][u,v]/(xv-yu)\) with Ravi&rsquo;s definition?</li>
<li>Show that the following properties are preserved under base change:
<ol class="org-ol">
<li>open embedding</li>
<li>closed embedding</li>
<li>affine</li>
<li>finite (affine + finite as a module) (optional)</li>
</ol></li>
<li>9.6.1 (Check that the Segre embedding is a closed embedding)</li>
<li>9.6.B (Equations of the Segre embedding)</li>
<li>6.4.A, 6.4.B (Maps of graded rings and Proj)
But NOT all maps of Proj are of this form!</li>
<li>6.4.D (Veronese)</li>
<li>6.4.F</li>
</ol></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org5a9e422" class="outline-3">
<h3 id="org5a9e422" class="collapsible">Week 7</h3>
<div class="outline-text-3" id="text-org5a9e422">
<ul class="org-ul">
<li><b><b>Read:</b></b> -   Sections 5.1 and 5.2
<ul class="org-ul">
<li>Sections 6.1, 6.2, 6.3,</li>
<li>Sections 7.1, 8.1</li>
</ul></li>

<li><b><b>Important points:</b></b>
<ul class="org-ul">
<li><b><b>5.1, 5.2:</b></b> Learn the adjectives: irreducible, Noetherian, reduced, integral. Do 5.2.F (integral = reduced + irreducible).</li>
<li><b><b>6.1, 6.2, 6.3:</b></b> This seems long, but it&rsquo;s mostly discursive, trying to motivate the right definition of a morphism. The upshot is 6.2.2, which is more important than the technical definition in 6.3. Do 6.3.C to nail down your understanding. Highly recommended - 6.3.E, 6.3.F. Go lightly over 6.3.9 and later.</li>
<li><b><b>7.1 (open embeddings):</b></b> These are uncomplicated, so this should be easy.</li>
<li><b><b>8.1 (closed embeddings):</b></b> There is an initial learning curve here (but eventually, they become as easy as open embeddings). Learn about the ideal sheaf. Recommended: 8.1.C, 8.1.D, 8.1.E, 8.1.J.</li>
</ul></li>
</ul>
</div>


<div id="outline-container-orgafa65b2" class="outline-4">
<h4 id="orgafa65b2">Discussion</h4>
<div class="outline-text-4" id="text-orgafa65b2">
<ol class="org-ol">
<li>Thursday

<ol class="org-ol">
<li>6.3.B
For affines, morphism of locally ringed spaces = induced by a ring map</li>
<li>6.3.A
Morphisms glue</li>
<li>6.3.C
Morphism is locally induced by ring maps</li>
<li>6.3.F
Morphism to Spec A</li>
<li>6.3.I
Spec Z is final</li>
<li>6.3.H
Structure map of Proj</li>
<li>6.3.J
Map from a point</li>
<li>6.3.M
(Some) morphisms to projective space</li>
</ol></li>

<li><p>
Friday
</p>

<p>
\({\mathbf A}^{n} = Spec Z[x_{1},\dots, x_{n}]\). \({\mathbf P}^{n} = Proj Z[X_{0}, \dots, X_{n}]\)
</p>

<ol class="org-ol">
<li>A different take on 6.3.M
<ul class="org-ul">
<li>Construct a morphism \(\mathbf{A}^{{n+1}} - 0 \to \mathbf{P}^{n}\).</li>
<li>Show that a morphism \(X \to \mathbf{A}^{{n+1}} - 0\) is the same as \(n+1\) global sections \(f_{0}, \dots f_{n}\) of \(O_{X}\) that do not have a common zero.</li>
<li>Conclude that such \(f_{i}\) give a map \(X \to \mathbf{P}^{n}\).</li>
<li>You now see why all maps \(X \to \mathbf{P}^{n}\) may not arise in this way.</li>
</ul></li>

<li>Make sense of the map \(\mathbf{P}^{1} \to \mathbf{P}^{2}\) &ldquo;defined by \([X^{2}:XY:Y^{2}]\)&rdquo;</li>

<li>8.1.D (Use 7.3.4 - being affine is affine local on the target).
Closed embeddings = maps which locally Spec(A/I) -&gt; Spec A</li>

<li>Let p be a point of X.
Show that the natural map Spec k(p) -&gt; X is a closed embedding if and only if p is a closed point.</li>

<li>Show that the map in (2) &ldquo;\([X^{2}:XY:Y^{2}]\)&rdquo; is a closed embedding.</li>

<li>Generalise (2) for the &ldquo;rational normal curve&rdquo;: \(\mathbf{P}^{1} \to \mathbf{P}^{n}\) given by \([X^{n}:X^{n-1}Y:\dots:Y^{n}]\).</li>

<li>Describe the sheaf of ideals in (4) if p is a closed point.</li>

<li>Read 8.1.H and be convinced that this should work.</li>

<li>Let S be a graded ring and I &amp;sub; S a homogeneous ideal.
Construct a map Proj(S/I) -&gt; Proj(S) and show that it is a closed embedding.</li>

<li>Is the map Spec C[t] -&gt; Spec C[x,y] &ldquo;given by \((t^{2},t^{3})\)&rdquo; a closed embedding? A homeomorphism onto its image?</li>
</ol></li>
</ol>
</div>
</div>
</div>
