content/teaching/schemes/index.org
** Week 6
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   **Read:** [[http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf][Section 4.5]]
-   **Important points:** -   When you learn algebraic geometry, it is easy to see that affine schemes are important&#x2014;they are the building blocks of everything! It is less clear why projective schemes are important.        
  But projective schemes are everywhere! Almost everything you will see in your life as an algebraic geometer will be (quasi)-projective. Unfortunately, you have to take this statement on faith (right now).
  -   **4.5.A:** DIY projective scheme. This is worth doing just to convince yourself that you could build a projective scheme yourself by hand.
    The \({\rm Proj}\) construction is a slick shortcut.
  -   **4.5.4:** Why should projective schemes have to do anything with graded rings? Ravi talks a bit about this in the pseudo-lectures.
    -   **One answer:** if you want equations to make sense in projective space, they have to be homogeneous. So the notion of degree comes in fundamentally.
    -   **A different answer:** A projective scheme is an affine scheme (minus some "irrelevant points") modulo the action of the multiplicative group \(\mathbb G_m\).
      A graded ring is the same as a ring along with the action of the multiplicative group \(\mathbb G_m\) (why is this?).
      So graded rings naturally come in when we consider affine schemes with a \(\mathbb G_m\) action ("up to scaling").
  -   **4.5.7:** This section looks short, but it will take time to digest!
  -   **4.5.O, 4.5.P:** If you can do these, you have a good understanding of the projective space.
-   **Watch:** [[https://www.youtube.com/watch?v=JZ01Akw52z8][AGITTOC Pseudolecture 8]]


*** Discussions

1.  Thursday

   1.  The basics

      Let \(A = A_0 \oplus A_1 \oplus A_2 \oplus \cdots \) be a graded ring.

      1.  What is the set \({\rm Proj}\ A\)?
      2.  Describe a base for the topology on \({\rm Proj}\ A\).
      3.  Describe the structure sheaf of \({\rm Proj}\ A\) by describing its value on the basic open sets.
      4.  Why is this a scheme?
      5.  Write a finite affine cover (under suitable conditions).

   2.  Examples

      Let \(k\) be an algebraically closed field.

      1.  Let \(P = {\rm Proj}\ k[X,Y,Z]\), variables in degree 1.
         1.  What is your affine cover in this case (from (5))?
         2.  What are the closed points of \(P\)? Interpret them as lines in \(k^{\oplus 3}\).

      2.  Let \(P = {\rm Proj}\ k[t][X,Y,Z]\), where \(t\) has degree 0 and \(X,Y,Z\) have degree 1.
         Repeat (1) and (2). You will have to modify the interpretation in (2).
         *Hint: There is a map \(P \to {\rm Spec}\ k[t]\) and it maps closed points to closed points.*

      3.  **Only if you have time**
         Let \(S = {\rm Proj}\ k[u,v][X,Y]/(Xv-Yu)\), where \(u,v\) have degree 0 and \(X,Y\) have degree 1.
         Repeat (1) and (2). Describe the map \(S \to {\rm Spec}\ k[u,v]\).

2.  Friday

   1.  Playing with Proj

      Let \(k\) be an algebraically closed field. 

      -   **Trivial base ring and no equations:** Let \(A = k[X_0, \dots, X_n]\).
        Show that closed points of \({\rm Proj}\ A\) = Lines in \(k^{n+1}\) = \((n+1)\)-tuples of homogeneous coordinates \([x_0:\dots:x_n]\) where \(x_i \in k\) are not all zero.

      -   **Equations:** Let \(A = k[X_0, \dots, X_n]/(F_1, \dots, F_m)\).
        Show that closed points of \({\rm Proj}\ A\) = \((n+1)\)-tuples of homogeneous coordinates satisfying all the equations \(F_i = 0\).

      -   **Non-trivial base rings:** Let \(A = A_0 \oplus A_1 \oplus \cdots \).
        -   Construct a map \(\pi \colon {\rm Proj}\ A \to {\rm Spec}\ A_0\).
          For now, describe the map on points. It can be upgraded to a map of schemes.

          Via \({\pi}\), we can think of \({\rm Proj}\ A\) as fibered over \({\rm Spec}\ A_0\), and try to understand the fibers.

        -   Suppose \(A\) is finitely generated over \(A_0\). Then \(\pi\) will turn out to be a proper map. Proper maps send closed sets to closed sets. In particular, they send closed points to closed points. So closed points of \({\rm Proj} A\) are fibered over closed points of \({\rm Spec}\ A_0\).

          Take \(A = k[t][X_0, \dots, X_n]\), where \(t\) has degree 0 and the \(X_i\) have degree 1.

          -   Show that the fiber of \({\rm Proj}\ A\) over a closed point of \({\rm Spec}\ k[t]\) is a copy of \({\rm Proj}\ k[X_0, \dots, X_n]\). For now, show this just for the sets of closed points, but it can be upgraded to a statement about schemes.

      -   **Non-trivial base rings and equations:** Let \(A = k[s,t][X,Y,Z]/(X^2+sY^2+tZ^2)\), where \(s,t\) have degree 0 and \(X,Y,Z\) have degree 1.
        -   Recall the map \(\pi \colon {\rm Proj}\ A \to {\rm Spec}\ k[s,t]\). What is its fiber over the point \((s-a, t-b)\)?

        -   We say that the map \(\pi\) describes a family of projective \(k\)-schemes (in this case conics in \(\mathbb P^2_k\)) parametrized by \({\rm Spec}\ k[s,t]\). Do you see what this means?

        -   **Slogan:** \({\rm Proj\ } A\) is a family of projective schemes parametrized by \({\rm Spec}\ A_0\).

      -   **Another non-trivial base ring and equations:** Let \(A = k[u,v][X,Y]/(Xv-Yu)\).
        -   Describe the closed points of \({\rm Proj}\ A\) using the map \(\pi\) to \({\rm Spec}\ k[u,v]\) (be careful!)
        -   Describe the affine charts of \({\rm Proj}\ A\).
        -   Is \({\rm Proj}\ A\) reducible or irreducible? Is it smooth or singular?
        -   Try to draw a picture of \(\pi \colon {\rm Proj}\ A \to \mathbb A^2\).
        -   Can you write the map \({\rm Proj}\ A \to \mathbb A^2\) on the affine charts?


** Week 5
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   Read:
  -   Finish Chapter 3.
  -   Chapter 4: Up to 4.4
-   Important points:
  -   **4.1.2:** You must really understand the proof of this theorem, so I urge you to work out the module case (exercise 4.1.D) to make sure you have.
  -   **4.2:** The art of visualising nilpotents. This feels like pseudo-mathematics, but it is strangely enlightening.
  -   **4.3:** Definition of scheme &#x2013; no surprises here.
  -   **4.4:** Take your time to read these in detail.
-   Watch: [[https://www.youtube.com/watch?v=qDN_hwEXH0k][AGITTOC Pseudolecture 6]] and [[https://www.youtube.com/watch?v=4KJwmiYHVk4][first half of pseudolecture 7]]
  It is becoming hard to match the pseudo-lectures exactly to our readings. What we did in week 4 gets covered in pseudolecture 4, 5, and the beginning of 6. This is because I am skipping / going fast over things you have already seen in your first algebraic geometry course (like Noetherian topological spaces, irreducibility, Hilbert basis theorem). So feel free to jump/skip around in the lectures.


