docs/teaching/schemes/index.html


<div id="outline-container-org02b3b5e" class="outline-3">
<h3 id="org02b3b5e" class="collapsible">Week 6</h3>
<div class="outline-text-3" id="text-org02b3b5e">
<ul class="org-ul">
<li><b><b>Read:</b></b> <a href="http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf">Section 4.5</a></li>
<li><b><b>Important points:</b></b> -   When you learn algebraic geometry, it is easy to see that affine schemes are important&amp;#x2014;they are the building blocks of everything! It is less clear why projective schemes are important.        
But projective schemes are everywhere! Almost everything you will see in your life as an algebraic geometer will be (quasi)-projective. Unfortunately, you have to take this statement on faith (right now).
<ul class="org-ul">
<li><b><b>4.5.A:</b></b> DIY projective scheme. This is worth doing just to convince yourself that you could build a projective scheme yourself by hand.
The \({\rm Proj}\) construction is a slick shortcut.</li>
<li><b><b>4.5.4:</b></b> Why should projective schemes have to do anything with graded rings? Ravi talks a bit about this in the pseudo-lectures.
<ul class="org-ul">
<li><b><b>One answer:</b></b> if you want equations to make sense in projective space, they have to be homogeneous. So the notion of degree comes in fundamentally.</li>
<li><b><b>A different answer:</b></b> A projective scheme is an affine scheme (minus some &ldquo;irrelevant points&rdquo;) modulo the action of the multiplicative group \(\mathbb G_m\).
A graded ring is the same as a ring along with the action of the multiplicative group \(\mathbb G_m\) (why is this?).
So graded rings naturally come in when we consider affine schemes with a \(\mathbb G_m\) action (&ldquo;up to scaling&rdquo;).</li>
</ul></li>
<li><b><b>4.5.7:</b></b> This section looks short, but it will take time to digest!</li>
<li><b><b>4.5.O, 4.5.P:</b></b> If you can do these, you have a good understanding of the projective space.</li>
</ul></li>
<li><b><b>Watch:</b></b> <a href="https://www.youtube.com/watch?v=JZ01Akw52z8">AGITTOC Pseudolecture 8</a></li>
</ul>
</div>


<div id="outline-container-org83e939d" class="outline-4">
<h4 id="org83e939d">Discussions</h4>
<div class="outline-text-4" id="text-org83e939d">
<ol class="org-ol">
<li>Thursday

<ol class="org-ol">
<li><p>
The basics
</p>

<p>
Let \(A = A_0 \oplus A_1 \oplus A_2 \oplus \cdots \) be a graded ring.
</p>

<ol class="org-ol">
<li>What is the set \({\rm Proj}\ A\)?</li>
<li>Describe a base for the topology on \({\rm Proj}\ A\).</li>
<li>Describe the structure sheaf of \({\rm Proj}\ A\) by describing its value on the basic open sets.</li>
<li>Why is this a scheme?</li>
<li>Write a finite affine cover (under suitable conditions).</li>
</ol></li>

<li><p>
Examples
</p>

<p>
Let \(k\) be an algebraically closed field.
</p>

<ol class="org-ol">
<li>Let \(P = {\rm Proj}\ k[X,Y,Z]\), variables in degree 1.
<ol class="org-ol">
<li>What is your affine cover in this case (from (5))?</li>
<li>What are the closed points of \(P\)? Interpret them as lines in \(k^{\oplus 3}\).</li>
</ol></li>

<li>Let \(P = {\rm Proj}\ k[t][X,Y,Z]\), where \(t\) has degree 0 and \(X,Y,Z\) have degree 1.
Repeat (1) and (2). You will have to modify the interpretation in (2).
<b>Hint: There is a map \(P \to {\rm Spec}\ k[t]\) and it maps closed points to closed points.</b></li>

<li><b><b>Only if you have time</b></b>
Let \(S = {\rm Proj}\ k[u,v][X,Y]/(Xv-Yu)\), where \(u,v\) have degree 0 and \(X,Y\) have degree 1.
Repeat (1) and (2). Describe the map \(S \to {\rm Spec}\ k[u,v]\).</li>
</ol></li>
</ol></li>

<li>Friday

<ol class="org-ol">
<li><p>
Playing with Proj
</p>

<p>
Let \(k\) be an algebraically closed field. 
</p>

<ul class="org-ul">
<li><b><b>Trivial base ring and no equations:</b></b> Let \(A = k[X_0, \dots, X_n]\).
Show that closed points of \({\rm Proj}\ A\) = Lines in \(k^{n+1}\) = \((n+1)\)-tuples of homogeneous coordinates \([x_0:\dots:x_n]\) where \(x_i \in k\) are not all zero.</li>

<li><b><b>Equations:</b></b> Let \(A = k[X_0, \dots, X_n]/(F_1, \dots, F_m)\).
Show that closed points of \({\rm Proj}\ A\) = \((n+1)\)-tuples of homogeneous coordinates satisfying all the equations \(F_i = 0\).</li>

<li><b><b>Non-trivial base rings:</b></b> Let \(A = A_0 \oplus A_1 \oplus \cdots \).
<ul class="org-ul">
<li><p>
Construct a map \(\pi \colon {\rm Proj}\ A \to {\rm Spec}\ A_0\).
For now, describe the map on points. It can be upgraded to a map of schemes.
</p>

<p>
Via \({\pi}\), we can think of \({\rm Proj}\ A\) as fibered over \({\rm Spec}\ A_0\), and try to understand the fibers.
</p></li>

<li><p>
Suppose \(A\) is finitely generated over \(A_0\). Then \(\pi\) will turn out to be a proper map. Proper maps send closed sets to closed sets. In particular, they send closed points to closed points. So closed points of \({\rm Proj} A\) are fibered over closed points of \({\rm Spec}\ A_0\).
</p>

<p>
Take \(A = k[t][X_0, \dots, X_n]\), where \(t\) has degree 0 and the \(X_i\) have degree 1.
</p>

<ul class="org-ul">
<li>Show that the fiber of \({\rm Proj}\ A\) over a closed point of \({\rm Spec}\ k[t]\) is a copy of \({\rm Proj}\ k[X_0, \dots, X_n]\). For now, show this just for the sets of closed points, but it can be upgraded to a statement about schemes.</li>
</ul></li>
</ul></li>

<li><b><b>Non-trivial base rings and equations:</b></b> Let \(A = k[s,t][X,Y,Z]/(X^2+sY^2+tZ^2)\), where \(s,t\) have degree 0 and \(X,Y,Z\) have degree 1.
<ul class="org-ul">
<li>Recall the map \(\pi \colon {\rm Proj}\ A \to {\rm Spec}\ k[s,t]\). What is its fiber over the point \((s-a, t-b)\)?</li>

<li>We say that the map \(\pi\) describes a family of projective \(k\)-schemes (in this case conics in \(\mathbb P^2_k\)) parametrized by \({\rm Spec}\ k[s,t]\). Do you see what this means?</li>

<li><b><b>Slogan:</b></b> \({\rm Proj\ } A\) is a family of projective schemes parametrized by \({\rm Spec}\ A_0\).</li>
</ul></li>

<li><b><b>Another non-trivial base ring and equations:</b></b> Let \(A = k[u,v][X,Y]/(Xv-Yu)\).
<ul class="org-ul">
<li>Describe the closed points of \({\rm Proj}\ A\) using the map \(\pi\) to \({\rm Spec}\ k[u,v]\) (be careful!)</li>
<li>Describe the affine charts of \({\rm Proj}\ A\).</li>
<li>Is \({\rm Proj}\ A\) reducible or irreducible? Is it smooth or singular?</li>
<li>Try to draw a picture of \(\pi \colon {\rm Proj}\ A \to \mathbb A^2\).</li>
<li>Can you write the map \({\rm Proj}\ A \to \mathbb A^2\) on the affine charts?</li>
</ul></li>
</ul></li>
</ol></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org18fb6b4" class="outline-3">
<h3 id="org18fb6b4" class="collapsible">Week 5</h3>
<div class="outline-text-3" id="text-org18fb6b4">
<ul class="org-ul">
<li>Read:
<ul class="org-ul">
<li>Finish Chapter 3.</li>
<li>Chapter 4: Up to 4.4</li>
</ul></li>
<li>Important points:
<ul class="org-ul">
<li><b><b>4.1.2:</b></b> You must really understand the proof of this theorem, so I urge you to work out the module case (exercise 4.1.D) to make sure you have.</li>
<li><b><b>4.2:</b></b> The art of visualising nilpotents. This feels like pseudo-mathematics, but it is strangely enlightening.</li>
<li><b><b>4.3:</b></b> Definition of scheme &amp;#x2013; no surprises here.</li>
<li><b><b>4.4:</b></b> Take your time to read these in detail.</li>
</ul></li>
<li>Watch: <a href="https://www.youtube.com/watch?v=qDN_hwEXH0k">AGITTOC Pseudolecture 6</a> and <a href="https://www.youtube.com/watch?v=4KJwmiYHVk4">first half of pseudolecture 7</a>
It is becoming hard to match the pseudo-lectures exactly to our readings. What we did in week 4 gets covered in pseudolecture 4, 5, and the beginning of 6. This is because I am skipping / going fast over things you have already seen in your first algebraic geometry course (like Noetherian topological spaces, irreducibility, Hilbert basis theorem). So feel free to jump/skip around in the lectures.</li>
</ul>
</div>
