content/teaching/schemes/index.org
*** Discussion

1.  Poll

   Let $X = {\rm Spec}\ {\mathbb C} \sqcup {\rm Spec}\ {\mathbb C} \sqcup {\rm Spec}\ {\mathbb C} \sqcup \cdots$ (infinite disjoint union).
   Let $R = \mathbb C \times \mathbb C \times \mathbb C \times \cdots$ (infinite product).
    
   /poll 
   - X is an affine scheme; in fact X = Spec R.
   - X is an affine scheme, but it is not Spec R.
   - X is not an affine scheme.

2.  Thursday

   1.  Suppose \(g \in A\) does not vanish on the open set \({\rm spec}\ A_f\) contained in ${\rm spec}\ A$. 
      What can you say about \(g\)? Must it be a power of \(f\)?
   2.  4.1.A: Show that \(A_f \to O(D(f))\) is an isomorphism.
   3.  We know that elements of \(A\) give functions on ${\rm spec}\ A$, and functions form a sheaf.
      Then why is there work involved in showing that $O$ satisfies the sheaf axioms?
   4.  Prove the base-gluability of the structure sheaf.
   5.  4.3.F: Stalks of the structure sheaf.
   6.  4.1.D: Work through the construction of $\widehat M$.
   7.  4.1.5: Pitfall of a slick definition of $O(U)$.
      What is the correct description of $O(U)$?
   8.  Draw
      -   ${\rm Spec}\ {\mathbb C}[t]/t^2$
      -   ${\rm Spec}\ {\mathbb C}[t]/t^3$
      -   ${\rm Spec}\ {\mathbb C}[x,y]/(x^2,xy,y^2)$
      -   ${\rm Spec}\ {\mathbb C}[x,y]/(xy,y^2)$
      -   ${\rm Spec}\ {\mathbb Z}/(12)$

3.  Friday

   1.  **from yesterday**
      4.1.5: Pitfall of a slick definition of $O(U)$.
      What is the correct description of $O(U)$?
   2.  **enlightening** but **confusing**
      4.3.A: Isomorphisms of affine schemes = isomorphisms of rings
   3.  **easy**
      4.3.B: Distinguished open subschemes
      4.3.C: Open subschemes
      Think about 4.3.4 &#x2013; closed subschemes
   4.  **easy**
      4.3.G: Functions on locally ringed spaces
   5.  **easy**
      4.4.A: Gluing schemes
   6.  4.4.B/C: Lines and planes with doubled origins.
   7.  **do once in life**
      4.4.D: Charts of the projective space
   8.  4.4.F: Closed points of the projective space
      More generally, let \(A\) be a finitely generated \(k\)-algebra.
      What are the closed points of \(\mathbb P^n_A\)?
   9.  Example 4.4.12.
   10. **chinese remainder theorem**
       Example 4.4.11.


** Week 4
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   Read:
  -   Get comfortable wit [[http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf][2.5 (sheaves on a base)]] if you haven't already. We will very often work with a convenient base instead of the full topology.
  -   [[http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf][1.3.5 (tensor products), 1.3.6 (fiber products)]].
  -   Chapter 3 up to 3.6.
-   Important points
  -   3.2.1:: How to "evaluate" a "function" at a "point".
  -   Examples 1&#x2013;8: Learn to draw!
  -   3.2.4, 3.2.5 (the Nullstellensatz):: This is a major theorem, whose proof goes beyond just unravelling the definitions. But it is more important to digest the statement and its consequences than to know the proof. It's also good to keep track of where we use this theorem.
  -   3.2.G, 3.2.Q:: Wrap your head around non-closed fields and other rings that seem to have little to do with geometry.
  -   3.2.J/K, 3.4.I:: Pictures of quotient and localisation.
  -   3.2.10:: Induced maps on spectra.
  -   3.2.11, 3.2.12:: The fault of nilpotents
  -   3.4, 3.5:: Everything is important, but also fairly straightforward, especially if you have seen the Zariski topology.
  -   3.6.A:: Test your ability to go back and forth between algebra and geometry.
  -   3.6:: A lot of it should be deja-vu, but watch out for novelties&#x2013;non-closed/generic points (3.6.8, 3.6.10, 3.6.M, 3.6.N)
  -   3.6.J/K:: Explain why "classical points" (= maximal ideals) are enough for studying varieties (Hint: mostly because of the Nullstellensatz. Corollary: when we consider all primes, not just the maximals, Nullstellensatz becomes plays a less important role.)
-   Watch: [[https://www.youtube.com/watch?v=q473BSN2_qE][AGITTOC Pseudo-lecture 4]]


*** Discussion

1.  Thursday

   1.  3.2.H (Points of ${\mathbb Q}[x,y]$)
   2.  3.2.J (Points of a quotient)
   3.  3.2.K (Points of a localisation)
   4.  3.2.L (Thinking about localisation geometrically)
   5.  Draw pictures of the maps
      -   ${\rm spec}\ \mathbb Q \to {\rm spec}\ \mathbb Z$
      -   ${\rm spec}\ k[t]_{(t)} \to {\rm spec}\ k[t]$
      -   ${\rm spec}\ \mathbb C[x] \to {\rm spec}\ \mathbb R[x]$
      -   ${\rm spec}\ k[t] \to {\rm spec}\ k[x,y]/xy$ induced by $x \mapsto 0, y \mapsto t$.
      -   ${\rm spec}\ k[x,y]/xy \to {\rm spec}\ k[t]$ induced by $t \mapsto x+y$.
      -   ${\rm spec}\ k \to {\rm spec}\ k[t]$ induced by $t \mapsto a$ for some $a \in k$.
      -   ${\rm spec}\ \mathbb C \to {\rm spec}\ \mathbb Q[t]$ induced by $t \mapsto \sqrt{2}$.
   6.  Let $A$ and $B$ be finitely generated $k$ algebras, and $f \colon A \to B$ a map of $k$ algebras.
      -   Show that $f$ sends a closed point (maximal ideal) of ${\rm spec}\ B$ to a closed point of ${\rm spec}\ A$.
      -   Show that $f$ may not send closed points to closed points, in general.
   7.  Let $X = \mathbb A^n_{k}$.
      What are the residue fields of the closed points (max ideals) of $X$ if $k = \mathbb C$? If $k = \mathbb Q$?
   8.  3.2.R (Nilpotents and spec)
   9.  3.2.S (Nilradical = intersection of prime ideals).
      -   When is $R_f = 0$? (Only when $f$ is a nilpotent.)
      -   Aside: 
        For some rings ("Jacobson rings"), nilradical = intersection of all maximal ideals. This means that if $f$ and $g$ take the same value at every closed point, then $f-g$ is nilpotent. Fields are Jacobson (trivially) $\mathbb Z$ is Jacobson (easy), finitely generated algebras over Jacobson rings are Jacobson. Can you come up with an example of a non-Jacobson ring (hint: its ${\rm spec}$ must have "few" closed points).

2.  Friday

   1.  **easy** 
      3.6.I (closed points = maximal ideals)
      Related: What is the closure of a point $p$?
   2.  **easy**
      3.4.I (${\rm spec}\ A/I$ is closed in ${\rm spec}\ A$, and ${\rm spec}\ A_f$ is open.)
   3.  **important**
      3.5.A (distinguished opens form a base)
   4.  3.5.B/C, 3.6.G (coverings by distinguished opens and (quasi)-compactness)
   5.  3.2.S (Nilradical = intersection of prime ideals). &#x2013; skip proof at first
      -   When is $R_f = 0$? (only when $f$ is a nilpotent.)
      -   Aside: 
        For some rings ("Jacobson rings"), nilradical = intersection of all maximal ideals. This means that if $f$ and $g$ take the same value at every closed point, then $f-g$ is nilpotent. Fields are Jacobson (trivially) $\mathbb Z$ is Jacobson (easy), finitely generated algebras over Jacobson rings are Jacobson. Can you come up with an example of a non-Jacobson ring (hint: its ${\rm spec}$ must have "few" closed points).
   6.  3.4.F (radical of I = intersection of primes containing I)
      -   How do you intepret this statement geometrically?
   7.  3.4.5 (nilpotents and spec)
   8.  3.4.J (when does $f$ vanish on $V(I)$?)
   9.  3.5.E (inclusions among the distinguished opens)
   10. **I(.) and V(.) are mutual inverses**
       Prove Theorem 3.7.1


