docs/teaching/schemes/index.html


<div id="outline-container-org04e679d" class="outline-4">
<h4 id="org04e679d">Discussion</h4>
<div class="outline-text-4" id="text-org04e679d">
<ol class="org-ol">
<li><p>
Poll
</p>

<p>
Let \(X = {\rm Spec}\ {\mathbb C} \sqcup {\rm Spec}\ {\mathbb C} \sqcup {\rm Spec}\ {\mathbb C} \sqcup \cdots\) (infinite disjoint union).
Let \(R = \mathbb C \times \mathbb C \times \mathbb C \times \cdots\) (infinite product).
</p>

<p>
/poll 
</p>
<ul class="org-ul">
<li>X is an affine scheme; in fact X = Spec R.</li>
<li>X is an affine scheme, but it is not Spec R.</li>
<li>X is not an affine scheme.</li>
</ul></li>

<li>Thursday

<ol class="org-ol">
<li>Suppose \(g \in A\) does not vanish on the open set \({\rm spec}\ A_f\) contained in \({\rm spec}\ A\). 
What can you say about \(g\)? Must it be a power of \(f\)?</li>
<li>4.1.A: Show that \(A_f \to O(D(f))\) is an isomorphism.</li>
<li>We know that elements of \(A\) give functions on \({\rm spec}\ A\), and functions form a sheaf.
Then why is there work involved in showing that \(O\) satisfies the sheaf axioms?</li>
<li>Prove the base-gluability of the structure sheaf.</li>
<li>4.3.F: Stalks of the structure sheaf.</li>
<li>4.1.D: Work through the construction of \(\widehat M\).</li>
<li>4.1.5: Pitfall of a slick definition of \(O(U)\).
What is the correct description of \(O(U)\)?</li>
<li>Draw
<ul class="org-ul">
<li>\({\rm Spec}\ {\mathbb C}[t]/t^2\)</li>
<li>\({\rm Spec}\ {\mathbb C}[t]/t^3\)</li>
<li>\({\rm Spec}\ {\mathbb C}[x,y]/(x^2,xy,y^2)\)</li>
<li>\({\rm Spec}\ {\mathbb C}[x,y]/(xy,y^2)\)</li>
<li>\({\rm Spec}\ {\mathbb Z}/(12)\)</li>
</ul></li>
</ol></li>

<li>Friday

<ol class="org-ol">
<li><b><b>from yesterday</b></b>
4.1.5: Pitfall of a slick definition of \(O(U)\).
What is the correct description of \(O(U)\)?</li>
<li><b><b>enlightening</b></b> but <b><b>confusing</b></b>
4.3.A: Isomorphisms of affine schemes = isomorphisms of rings</li>
<li><b><b>easy</b></b>
4.3.B: Distinguished open subschemes
4.3.C: Open subschemes
Think about 4.3.4 &amp;#x2013; closed subschemes</li>
<li><b><b>easy</b></b>
4.3.G: Functions on locally ringed spaces</li>
<li><b><b>easy</b></b>
4.4.A: Gluing schemes</li>
<li>4.4.B/C: Lines and planes with doubled origins.</li>
<li><b><b>do once in life</b></b>
4.4.D: Charts of the projective space</li>
<li>4.4.F: Closed points of the projective space
More generally, let \(A\) be a finitely generated \(k\)-algebra.
What are the closed points of \(\mathbb P^n_A\)?</li>
<li>Example 4.4.12.</li>
<li><b><b>chinese remainder theorem</b></b>
Example 4.4.11.</li>
</ol></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgb450af4" class="outline-3">
<h3 id="orgb450af4" class="collapsible">Week 4</h3>
<div class="outline-text-3" id="text-orgb450af4">
<ul class="org-ul">
<li>Read:
<ul class="org-ul">
<li>Get comfortable wit <a href="http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf">2.5 (sheaves on a base)</a> if you haven&rsquo;t already. We will very often work with a convenient base instead of the full topology.</li>
<li><a href="http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf">1.3.5 (tensor products), 1.3.6 (fiber products)</a>.</li>
<li>Chapter 3 up to 3.6.</li>
</ul></li>
<li>Important points
<ul class="org-ul">
<li>3.2.1:: How to &ldquo;evaluate&rdquo; a &ldquo;function&rdquo; at a &ldquo;point&rdquo;.</li>
<li>Examples 1&amp;#x2013;8: Learn to draw!</li>
<li>3.2.4, 3.2.5 (the Nullstellensatz):: This is a major theorem, whose proof goes beyond just unravelling the definitions. But it is more important to digest the statement and its consequences than to know the proof. It&rsquo;s also good to keep track of where we use this theorem.</li>
<li>3.2.G, 3.2.Q:: Wrap your head around non-closed fields and other rings that seem to have little to do with geometry.</li>
<li>3.2.J/K, 3.4.I:: Pictures of quotient and localisation.</li>
<li>3.2.10:: Induced maps on spectra.</li>
<li>3.2.11, 3.2.12:: The fault of nilpotents</li>
<li>3.4, 3.5:: Everything is important, but also fairly straightforward, especially if you have seen the Zariski topology.</li>
<li>3.6.A:: Test your ability to go back and forth between algebra and geometry.</li>
<li>3.6:: A lot of it should be deja-vu, but watch out for novelties&amp;#x2013;non-closed/generic points (3.6.8, 3.6.10, 3.6.M, 3.6.N)</li>
<li>3.6.J/K:: Explain why &ldquo;classical points&rdquo; (= maximal ideals) are enough for studying varieties (Hint: mostly because of the Nullstellensatz. Corollary: when we consider all primes, not just the maximals, Nullstellensatz becomes plays a less important role.)</li>
</ul></li>
<li>Watch: <a href="https://www.youtube.com/watch?v=q473BSN2_qE">AGITTOC Pseudo-lecture 4</a></li>
</ul>
</div>


<div id="outline-container-orgbee5c9f" class="outline-4">
<h4 id="orgbee5c9f">Discussion</h4>
<div class="outline-text-4" id="text-orgbee5c9f">
<ol class="org-ol">
<li>Thursday

<ol class="org-ol">
<li>3.2.H (Points of \({\mathbb Q}[x,y]\))</li>
<li>3.2.J (Points of a quotient)</li>
<li>3.2.K (Points of a localisation)</li>
<li>3.2.L (Thinking about localisation geometrically)</li>
<li>Draw pictures of the maps
<ul class="org-ul">
<li>\({\rm spec}\ \mathbb Q \to {\rm spec}\ \mathbb Z\)</li>
<li>\({\rm spec}\ k[t]_{(t)} \to {\rm spec}\ k[t]\)</li>
<li>\({\rm spec}\ \mathbb C[x] \to {\rm spec}\ \mathbb R[x]\)</li>
<li>\({\rm spec}\ k[t] \to {\rm spec}\ k[x,y]/xy\) induced by \(x \mapsto 0, y \mapsto t\).</li>
<li>\({\rm spec}\ k[x,y]/xy \to {\rm spec}\ k[t]\) induced by \(t \mapsto x+y\).</li>
<li>\({\rm spec}\ k \to {\rm spec}\ k[t]\) induced by \(t \mapsto a\) for some \(a \in k\).</li>
<li>\({\rm spec}\ \mathbb C \to {\rm spec}\ \mathbb Q[t]\) induced by \(t \mapsto \sqrt{2}\).</li>
</ul></li>
<li>Let \(A\) and \(B\) be finitely generated \(k\) algebras, and \(f \colon A \to B\) a map of \(k\) algebras.
<ul class="org-ul">
<li>Show that \(f\) sends a closed point (maximal ideal) of \({\rm spec}\ B\) to a closed point of \({\rm spec}\ A\).</li>
<li>Show that \(f\) may not send closed points to closed points, in general.</li>
</ul></li>
<li>Let \(X = \mathbb A^n_{k}\).
What are the residue fields of the closed points (max ideals) of \(X\) if \(k = \mathbb C\)? If \(k = \mathbb Q\)?</li>
<li>3.2.R (Nilpotents and spec)</li>
<li>3.2.S (Nilradical = intersection of prime ideals).
<ul class="org-ul">
<li>When is \(R_f = 0\)? (Only when \(f\) is a nilpotent.)</li>
<li>Aside: 
For some rings (&ldquo;Jacobson rings&rdquo;), nilradical = intersection of all maximal ideals. This means that if \(f\) and \(g\) take the same value at every closed point, then \(f-g\) is nilpotent. Fields are Jacobson (trivially) \(\mathbb Z\) is Jacobson (easy), finitely generated algebras over Jacobson rings are Jacobson. Can you come up with an example of a non-Jacobson ring (hint: its \({\rm spec}\) must have &ldquo;few&rdquo; closed points).</li>
</ul></li>
</ol></li>

<li>Friday

<ol class="org-ol">
<li><b><b>easy</b></b> 
3.6.I (closed points = maximal ideals)
Related: What is the closure of a point \(p\)?</li>
<li><b><b>easy</b></b>
3.4.I (\({\rm spec}\ A/I\) is closed in \({\rm spec}\ A\), and \({\rm spec}\ A_f\) is open.)</li>
<li><b><b>important</b></b>
3.5.A (distinguished opens form a base)</li>
<li>3.5.B/C, 3.6.G (coverings by distinguished opens and (quasi)-compactness)</li>
<li>3.2.S (Nilradical = intersection of prime ideals). &amp;#x2013; skip proof at first
<ul class="org-ul">
<li>When is \(R_f = 0\)? (only when \(f\) is a nilpotent.)</li>
<li>Aside: 
For some rings (&ldquo;Jacobson rings&rdquo;), nilradical = intersection of all maximal ideals. This means that if \(f\) and \(g\) take the same value at every closed point, then \(f-g\) is nilpotent. Fields are Jacobson (trivially) \(\mathbb Z\) is Jacobson (easy), finitely generated algebras over Jacobson rings are Jacobson. Can you come up with an example of a non-Jacobson ring (hint: its \({\rm spec}\) must have &ldquo;few&rdquo; closed points).</li>
</ul></li>
<li>3.4.F (radical of I = intersection of primes containing I)
<ul class="org-ul">
<li>How do you intepret this statement geometrically?</li>
</ul></li>
<li>3.4.5 (nilpotents and spec)</li>
<li>3.4.J (when does \(f\) vanish on \(V(I)\)?)</li>
<li>3.5.E (inclusions among the distinguished opens)</li>
<li><b><b>I(.) and V(.) are mutual inverses</b></b>
Prove Theorem 3.7.1</li>
</ol></li>
</ol>
</div>
</div>
</div>
