content/teaching/schemes/index.org
** Week 3
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   Read: Two independent tracks
  -   (Sheaves continued): [[http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf][2.4, 2.5, 2.6]]
  -   (Affine schemes): [[http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf][3.1, 3.2 (up to 3.2.E, and especially Examples 1&#x2013;8)]].
-   Watch: [[https://youtu.be/0lZFVGsYxj8][AGITTOC Pseudo-lecture 3]]
-   Think:
  Come to terms with the new way of defining spaces from local models. The old mantra was "set + topology + local models + gluing maps". Now sheaves do the gluing for us, so the new mantra is "set + topology + sheaf of rings + local models".


*** Discussion

1.  Polls

   Let $X = \mathbb C^2$. Denote by $O_X^*$ the sheaf of maps to $\mathbb C^* = \mathbb C - \{0\}$.
   Let $m_n \colon O_X^* \to O_X^*$ be the map $f \mapsto f^n$.
    
   /poll The map $m_n$ above
   - is a surjection of sheaves and also a surjection on all open sets.
   - is a surjection of sheaves but not a surjection on all open sets.
   - not a surjection of sheaves.

2.  Thursday

   1.  Let $f \colon A \to B$ be a map of sheaves.
      Show using universal properties that the sheafification of the pre-sheaf cokernel of $f$ is the cokernel of $f$ in the category of sheaves.
   2.  2.4.C (for sheaves, compatible germs = section)
   3.  2.4.G (sheafification is unique up to a unique iso)
   4.  2.4.I,J,K (verifying the construction of sheafification)
   5.  2.4.M (sheafification does not change stalks)
   6.  2.4.P (exponential map)
   7.  2.5.B, C (sheaves on a base)
   8.  2.5.D (gluing sheaves)
   9.  2.6.D (exactness = exactness of stalks)
   10. 2.6.F (left exactness of global sections)

   1.  Main takeaways

      -   Sheaves of Ab groups forms an abelian cat.
        kernels, cokernels, images exist and behave like you expect.

      -   How to construct? Construct naively, and sheafify!

      -   How to detect? On stalks!

      -   Enough to work on a base.

      -   Everything holds for $O_X$ modules.

3.  Friday

   1.  **important** not logically necessary
      Definition: A differentiable manifold is a ringed space $(X, O_X)$ "which is locally isomorphic to $(U, O_U)$ where $U \subset \mathbb R^n$ is an open set and $O_U$ is the sheaf of differentiable real valued functions on $U$".
      1.  Make this precise (eliminate the " " marks).
         To do this, you will have to define the notion of an isomorphism of ringed spaces.
         More generally, try to define a morphism of ringed spaces.

      2.  Show that this definition is equivalent to the usual definition of a differentiable manifolds (using charts and gluing maps). 
         You will have to prove the (easy) fact that for $U, V \subset \mathbb R^n$, xif $\phi \colon U \to V$ is continuous, then it is differentiable if and only if differentiable functions pull back to differentiable functions.

   2.  -   Draw $spec k[t]_{(t)}$.
      -   Draw $spec Z_{(p)}$.
      -   Draw $spec \mathbb Z_p$ (the $p$-adics)
      -   Draw $spec k[[[[t]]]]$ (the ring of power series in $t$).

   3.  Describe $\mathbb A^1_{\mathbb R}$ and $\mathbb A^1_{\mathbb Q}$

   4.  Draw $spec \mathbb C[x,y]$.

   5.  Draw $spec \mathbb C[x,y]/xy$.

   6.  -   Draw $spec \mathbb C[x]/x^2$
      -   Draw $spec \mathbb C[x,y]/(x^2, xy, y^2)$

   7.  Go back to sheaves and convince yourselves that the category of sheaves is equivalent to the category of sheaves on a base.


** Week 2
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   Read: [[http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf][Chapter 1 Section 1.4, 2.1, 2.2, 2.3]]
-   Skim: [[http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf][Chapter 1 Section 1.3.6, 1.3.7, 1.5, 1.6]]
-   Watch: [[https://www.youtube.com/watch?v=mqt1f8owKrU][AGITOC Pseudo-lecture 2.]]
-   Do:
  1.  1.4.B (limits in `Sets`)
  2.  1.4.C ($\mathbb Q$ as a colimit)
  3.  1.4.F (localisation as a colimit)
  4.  2.1.A (stalk is a local ring)
  5.  2.2.D (sheaves of functions)
  6.  2.2.E (constant sheaves)
  7.  2.2.F (morphisms form a sheaf)
  8.  2.3.C (sheaf hom)
  9.  2.3.I (kernel of sheaf maps is a sheaf)
  10. 2.3.J (but the cokernel may not be a sheaf)

1.  Discussion

   1.  Thursday

      1.  Pre-class poll

         Consider the diagram $\cdots \to \mathbb Z \to \mathbb Z \to \cdots$ where all maps are multiplication by 2.

         /poll The limit of this diagram is
         - Zero
         - Z
         - Z[1/2] (integers localised at 2; alternative notation to accommodate the next option)
         - Z_{2} (the 2-adic integers)

           /poll The colimit of this diagram is
           - Zero
           - Z
           - Z[1/2] (integers localised at 2; alternative notation to accommodate the next option)
           - Z_{2} (the 2-adic integers)

      2. Points for discussion

         1.  In $R$ mod, describe the kernel of $A \to B$ as a limit and the cokernel as a colimit.
            Are these filtered?

         2.  1.4.B (explicit construction of the limit)

         3.  Generalise example 1.4.6 and describe $S^{-1}M$ as a colimit.

         4.  1.4.C ($\mathbb Q$ as a colimit)

         5.  1.4.D (explicit description of a filtered colimit)

         6.  Prove that (in $R$ mod) filtered colimits preserve exactness.
            Corollary: Localisation is exact! (important)
            Also try to see this directly, using fractions.

         7.  1.6.G (localisation commutes with hom for fin. pres. mod.)

         8.  2.1.A (stalk of sheaf of functions is a local ring)

         9.  Remind each other what is the constant sheaf and what is the skyscraper sheaf.
            What are the stalks of the constant sheaf?
            What are the stalks of a skyscraper sheaf?

         10. Remind each other what adjoint functors are. Give examples!

   2.  Friday

      1.  Problems for discussion

         1.  2.1.A (The ring of germs of diff. functions has only one maximal ideal.)

            Think of some other sheaves of rings. Are their germs local rings?
            Examples: cont. functions, diff. fuctions, holomorphic functions, constant sheaf $R$?

         2.  2.2.F (morphisms form a sheaf)
            2.2.G (sections form a sheaf)

         3.  Let $Y \to X$ be the inclusion of an open set. What is the sheaf of sections?

         4.  Let $S^1 \to S^1$ be the squaring map $z \to z^2$.
            Understand its sheaf of sections. What are its stalks? What are its global sections?

         5.  Can you construct a different sheaf whose stalks are the same as in the previous example?

         6.  **optional**
            2.2.J (Stalks of $O_X$ modules)

         7.  2.3.D (reality check for $Hom$ sheaves)

         8.  **important** 
            2.3.I (kernel of a map of sheaves is a sheaf!)

         9.  **important**
            2.3.J (but the cokernel need not be!)
            Play with the pre-sheaf $F$.

         10. Convince yourself (and your friends) that an algebraic variety (with the Zariski topology) along with the sheaf of regular functions is a locally ringed space.


