docs/teaching/schemes/index.html


<div id="outline-container-orgf972079" class="outline-3">
<h3 id="orgf972079" class="collapsible">Week 3</h3>
<div class="outline-text-3" id="text-orgf972079">
<ul class="org-ul">
<li>Read: Two independent tracks
<ul class="org-ul">
<li>(Sheaves continued): <a href="http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf">2.4, 2.5, 2.6</a></li>
<li>(Affine schemes): <a href="http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf">3.1, 3.2 (up to 3.2.E, and especially Examples 1&amp;#x2013;8)</a>.</li>
</ul></li>
<li>Watch: <a href="https://youtu.be/0lZFVGsYxj8">AGITTOC Pseudo-lecture 3</a></li>
<li>Think:
Come to terms with the new way of defining spaces from local models. The old mantra was &ldquo;set + topology + local models + gluing maps&rdquo;. Now sheaves do the gluing for us, so the new mantra is &ldquo;set + topology + sheaf of rings + local models&rdquo;.</li>
</ul>
</div>


<div id="outline-container-orgec08e91" class="outline-4">
<h4 id="orgec08e91">Discussion</h4>
<div class="outline-text-4" id="text-orgec08e91">
<ol class="org-ol">
<li><p>
Polls
</p>

<p>
Let \(X = \mathbb C^2\). Denote by \(O_X^*\) the sheaf of maps to \(\mathbb C^* = \mathbb C - \{0\}\).
Let \(m_n \colon O_X^* \to O_X^*\) be the map \(f \mapsto f^n\).
</p>

<p>
/poll The map \(m_n\) above
</p>
<ul class="org-ul">
<li>is a surjection of sheaves and also a surjection on all open sets.</li>
<li>is a surjection of sheaves but not a surjection on all open sets.</li>
<li>not a surjection of sheaves.</li>
</ul></li>

<li>Thursday

<ol class="org-ol">
<li>Let \(f \colon A \to B\) be a map of sheaves.
Show using universal properties that the sheafification of the pre-sheaf cokernel of \(f\) is the cokernel of \(f\) in the category of sheaves.</li>
<li>2.4.C (for sheaves, compatible germs = section)</li>
<li>2.4.G (sheafification is unique up to a unique iso)</li>
<li>2.4.I,J,K (verifying the construction of sheafification)</li>
<li>2.4.M (sheafification does not change stalks)</li>
<li>2.4.P (exponential map)</li>
<li>2.5.B, C (sheaves on a base)</li>
<li>2.5.D (gluing sheaves)</li>
<li>2.6.D (exactness = exactness of stalks)</li>
<li>2.6.F (left exactness of global sections)</li>

<li>Main takeaways

<ul class="org-ul">
<li>Sheaves of Ab groups forms an abelian cat.
kernels, cokernels, images exist and behave like you expect.</li>

<li>How to construct? Construct naively, and sheafify!</li>

<li>How to detect? On stalks!</li>

<li>Enough to work on a base.</li>

<li>Everything holds for \(O_X\) modules.</li>
</ul></li>
</ol></li>

<li>Friday

<ol class="org-ol">
<li><b><b>important</b></b> not logically necessary
Definition: A differentiable manifold is a ringed space \((X, O_X)\) &ldquo;which is locally isomorphic to \((U, O_U)\) where \(U \subset \mathbb R^n\) is an open set and \(O_U\) is the sheaf of differentiable real valued functions on \(U\)&rdquo;.
<ol class="org-ol">
<li>Make this precise (eliminate the &ldquo; &rdquo; marks).
To do this, you will have to define the notion of an isomorphism of ringed spaces.
More generally, try to define a morphism of ringed spaces.</li>

<li>Show that this definition is equivalent to the usual definition of a differentiable manifolds (using charts and gluing maps). 
You will have to prove the (easy) fact that for \(U, V \subset \mathbb R^n\), xif \(\phi \colon U \to V\) is continuous, then it is differentiable if and only if differentiable functions pull back to differentiable functions.</li>
</ol></li>

<li>-   Draw \(spec k[t]_{(t)}\).
<ul class="org-ul">
<li>Draw \(spec Z_{(p)}\).</li>
<li>Draw \(spec \mathbb Z_p\) (the $p$-adics)</li>
<li>Draw \(spec k[[[[t]]]]\) (the ring of power series in \(t\)).</li>
</ul></li>

<li>Describe \(\mathbb A^1_{\mathbb R}\) and \(\mathbb A^1_{\mathbb Q}\)</li>

<li>Draw \(spec \mathbb C[x,y]\).</li>

<li>Draw \(spec \mathbb C[x,y]/xy\).</li>

<li>-   Draw \(spec \mathbb C[x]/x^2\)
<ul class="org-ul">
<li>Draw \(spec \mathbb C[x,y]/(x^2, xy, y^2)\)</li>
</ul></li>

<li>Go back to sheaves and convince yourselves that the category of sheaves is equivalent to the category of sheaves on a base.</li>
</ol></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org3a1b937" class="outline-3">
<h3 id="org3a1b937" class="collapsible">Week 2</h3>
<div class="outline-text-3" id="text-org3a1b937">
<ul class="org-ul">
<li>Read: <a href="http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf">Chapter 1 Section 1.4, 2.1, 2.2, 2.3</a></li>
<li>Skim: <a href="http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf">Chapter 1 Section 1.3.6, 1.3.7, 1.5, 1.6</a></li>
<li>Watch: <a href="https://www.youtube.com/watch?v=mqt1f8owKrU">AGITOC Pseudo-lecture 2.</a></li>
<li>Do:
<ol class="org-ol">
<li>1.4.B (limits in `Sets`)</li>
<li>1.4.C (\(\mathbb Q\) as a colimit)</li>
<li>1.4.F (localisation as a colimit)</li>
<li>2.1.A (stalk is a local ring)</li>
<li>2.2.D (sheaves of functions)</li>
<li>2.2.E (constant sheaves)</li>
<li>2.2.F (morphisms form a sheaf)</li>
<li>2.3.C (sheaf hom)</li>
<li>2.3.I (kernel of sheaf maps is a sheaf)</li>
<li>2.3.J (but the cokernel may not be a sheaf)</li>
</ol></li>

<li>Discussion

<ol class="org-ol">
<li>Thursday

<ol class="org-ol">
<li><p>
Pre-class poll
</p>

<p>
Consider the diagram \(\cdots \to \mathbb Z \to \mathbb Z \to \cdots\) where all maps are multiplication by 2.
</p>

<p>
/poll The limit of this diagram is
</p>
<ul class="org-ul">
<li>Zero</li>
<li>Z</li>
<li>Z<code>[1/2]</code> (integers localised at 2; alternative notation to accommodate the next option)</li>
<li><p>
Z<sub>2</sub> (the 2-adic integers)
</p>

<p>
/poll The colimit of this diagram is
</p>
<ul class="org-ul">
<li>Zero</li>
<li>Z</li>
<li>Z<code>[1/2]</code> (integers localised at 2; alternative notation to accommodate the next option)</li>
<li>Z<sub>2</sub> (the 2-adic integers)</li>
</ul></li>
</ul></li>

<li>Points for discussion

<ol class="org-ol">
<li>In \(R\) mod, describe the kernel of \(A \to B\) as a limit and the cokernel as a colimit.
Are these filtered?</li>

<li>1.4.B (explicit construction of the limit)</li>

<li>Generalise example 1.4.6 and describe \(S^{-1}M\) as a colimit.</li>

<li>1.4.C (\(\mathbb Q\) as a colimit)</li>

<li>1.4.D (explicit description of a filtered colimit)</li>

<li>Prove that (in \(R\) mod) filtered colimits preserve exactness.
Corollary: Localisation is exact! (important)
Also try to see this directly, using fractions.</li>

<li>1.6.G (localisation commutes with hom for fin. pres. mod.)</li>

<li>2.1.A (stalk of sheaf of functions is a local ring)</li>

<li>Remind each other what is the constant sheaf and what is the skyscraper sheaf.
What are the stalks of the constant sheaf?
What are the stalks of a skyscraper sheaf?</li>

<li>Remind each other what adjoint functors are. Give examples!</li>
</ol></li>
</ol></li>

<li>Friday

<ol class="org-ol">
<li>Problems for discussion

<ol class="org-ol">
<li><p>
2.1.A (The ring of germs of diff. functions has only one maximal ideal.)
</p>

<p>
Think of some other sheaves of rings. Are their germs local rings?
Examples: cont. functions, diff. fuctions, holomorphic functions, constant sheaf \(R\)?
</p></li>

<li>2.2.F (morphisms form a sheaf)
2.2.G (sections form a sheaf)</li>

<li>Let \(Y \to X\) be the inclusion of an open set. What is the sheaf of sections?</li>

<li>Let \(S^1 \to S^1\) be the squaring map \(z \to z^2\).
Understand its sheaf of sections. What are its stalks? What are its global sections?</li>

<li>Can you construct a different sheaf whose stalks are the same as in the previous example?</li>

<li><b><b>optional</b></b>
2.2.J (Stalks of \(O_X\) modules)</li>

<li>2.3.D (reality check for \(Hom\) sheaves)</li>

<li><b><b>important</b></b> 
2.3.I (kernel of a map of sheaves is a sheaf!)</li>

<li><b><b>important</b></b>
2.3.J (but the cokernel need not be!)
Play with the pre-sheaf \(F\).</li>

<li>Convince yourself (and your friends) that an algebraic variety (with the Zariski topology) along with the sheaf of regular functions is a locally ringed space.</li>
</ol></li>
</ol></li>
</ol></li>
</ul>
</div>
</div>
