content/teaching/schemes/index.org
** Week 1
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   Read: [[http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf][Chapter 1 Sections 1.1&#x2013;1.3.4 (localisation)]].
-   Watch: [[https://www.youtube.com/watch?v=WTEZjR5aNjw][AGITOC Pseudo-lecture 1]].
-   Do: 1.2.B, 1.3.A, 1.3.D,  1.3.E, 1.3.G, and ponder:
  1.  "A group is a category with 1 object and invertible morphisms." Love it or hate it?
  2.  Learn the language of universal properties and use it to phrase the constructions you already know. For example: kernels, cokernels, finite/infinite sums and products.
  3.  You may not have seen localisation before. That's OK. Try to digest as much as you can.
  4.  Show (preferably using the universal property) that the localisation $R_f$ is isomorphic to $R[y]/(yf-1)$.
  5.  What is the geometric meaning of localisation? Can you use it to construct an example where $R \neq 0$ but $R_f = 0$?


*** Discussion

1.  Thursday

   1.  Points for discussion

      -   What was easy, hard, confusing?
      -   &#x2026; insightful?
      -   Examples!
      -   1.2.B (automorphism group)
      -   1.3.A (unique init/final obj)
      -   What is the universal property for:
        -   Disjoint union of two sets
        -   The kernel of A -> B
        -   The cokernel of A -> B
        -   The one-point compactification
        -   The metric completion
      -   What are the initial/final objects in Top, Vec, Ab, Set? (create a poll?)

2.  Friday

   1.  Pre-class poll

      Consider the category whose objects are algebraic field extensions of $\mathbb Q$ (and whose morphisms are maps of fields).

      /poll The category above has
      - a final object, namely $\overline{\mathbb Q}$.
      - no final object.

   2.  Points for discussion

      1.  warm-up
         Let $R = \mathbb Z$ and $f = 2$.
         -   Describe the elements of $R_f$ explicitly.
         -   Let $K$ be a field of characteristic $59$. Show that there is a unique map $R_f \to K$.
      2.  notation-alert!
         $R = \mathbb Z$ and $p = 2$.
         -   Describe the elements of $R_{(p)}$ (horrible notation, I know!)
         -   What's the analogue of the second part of the previous exercise?
      3.  instructive
         Show (preferably using the universal property) that the localisation $R_f$ is isomorphic to $R[y]/(yf-1)$.
      4.  Baby 1.3.C: localisation is injective for integral domains.
      5.  geometry! important!
         Suppose $R$ is the ring of functions of an affine variety $X$.
         Then $R_f$ is the ring of functions of <span class="underline"><span class="underline"><span class="underline">_</span></span></span>.
      6.  Having done (5), can you "see" (4)?
      7.  Can you construct an example where $R \neq 0$ but $R_f = 0$?
      8.  1.3.E ($\star$)


* More things to read or watch
:PROPERTIES:
:html_headline_class: collapsible
:END:

-   [[https://math216.wordpress.com/agittoc-2020/][Ravi Vakil's pseudo-course website]]
-   [[https://www.youtube.com/watch?v=BX3jiLdehA4&list=PL8yHsr3EFj50Un2NpfPySgXctRQK7CLG-][Richard Borcherd's lectures on schemes]]
-   [[pointsareprimes.pdf][Why are points of a scheme the prime ideals]]

