docs/teaching/schemes/index.html


<div id="outline-container-orgbed94c2" class="outline-3">
<h3 id="orgbed94c2" class="collapsible">Week 1</h3>
<div class="outline-text-3" id="text-orgbed94c2">
<ul class="org-ul">
<li>Read: <a href="http://math.stanford.edu/~vakil/216blog/FOAGnov1817public.pdf">Chapter 1 Sections 1.1&amp;#x2013;1.3.4 (localisation)</a>.</li>
<li>Watch: <a href="https://www.youtube.com/watch?v=WTEZjR5aNjw">AGITOC Pseudo-lecture 1</a>.</li>
<li>Do: 1.2.B, 1.3.A, 1.3.D,  1.3.E, 1.3.G, and ponder:
<ol class="org-ol">
<li>&ldquo;A group is a category with 1 object and invertible morphisms.&rdquo; Love it or hate it?</li>
<li>Learn the language of universal properties and use it to phrase the constructions you already know. For example: kernels, cokernels, finite/infinite sums and products.</li>
<li>You may not have seen localisation before. That&rsquo;s OK. Try to digest as much as you can.</li>
<li>Show (preferably using the universal property) that the localisation \(R_f\) is isomorphic to \(R[y]/(yf-1)\).</li>
<li>What is the geometric meaning of localisation? Can you use it to construct an example where \(R \neq 0\) but \(R_f = 0\)?</li>
</ol></li>
</ul>
</div>


<div id="outline-container-org3e156ce" class="outline-4">
<h4 id="org3e156ce">Discussion</h4>
<div class="outline-text-4" id="text-org3e156ce">
<ol class="org-ol">
<li>Thursday

<ol class="org-ol">
<li>Points for discussion

<ul class="org-ul">
<li>What was easy, hard, confusing?</li>
<li>&amp;#x2026; insightful?</li>
<li>Examples!</li>
<li>1.2.B (automorphism group)</li>
<li>1.3.A (unique init/final obj)</li>
<li>What is the universal property for:
<ul class="org-ul">
<li>Disjoint union of two sets</li>
<li>The kernel of A -&gt; B</li>
<li>The cokernel of A -&gt; B</li>
<li>The one-point compactification</li>
<li>The metric completion</li>
</ul></li>
<li>What are the initial/final objects in Top, Vec, Ab, Set? (create a poll?)</li>
</ul></li>
</ol></li>

<li>Friday

<ol class="org-ol">
<li><p>
Pre-class poll
</p>

<p>
Consider the category whose objects are algebraic field extensions of \(\mathbb Q\) (and whose morphisms are maps of fields).
</p>

<p>
/poll The category above has
</p>
<ul class="org-ul">
<li>a final object, namely \(\overline{\mathbb Q}\).</li>
<li>no final object.</li>
</ul></li>

<li>Points for discussion

<ol class="org-ol">
<li>warm-up
Let \(R = \mathbb Z\) and \(f = 2\).
<ul class="org-ul">
<li>Describe the elements of \(R_f\) explicitly.</li>
<li>Let \(K\) be a field of characteristic \(59\). Show that there is a unique map \(R_f \to K\).</li>
</ul></li>
<li>notation-alert!
\(R = \mathbb Z\) and \(p = 2\).
<ul class="org-ul">
<li>Describe the elements of \(R_{(p)}\) (horrible notation, I know!)</li>
<li>What&rsquo;s the analogue of the second part of the previous exercise?</li>
</ul></li>
<li>instructive
Show (preferably using the universal property) that the localisation \(R_f\) is isomorphic to \(R[y]/(yf-1)\).</li>
<li>Baby 1.3.C: localisation is injective for integral domains.</li>
<li>geometry! important!
Suppose \(R\) is the ring of functions of an affine variety \(X\).
Then \(R_f\) is the ring of functions of &lt;span class=&ldquo;underline&rdquo;&gt;&lt;span class=&ldquo;underline&rdquo;&gt;&lt;span class=&ldquo;underline&rdquo;&gt;_&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;.</li>
<li>Having done (5), can you &ldquo;see&rdquo; (4)?</li>
<li>Can you construct an example where \(R \neq 0\) but \(R_f = 0\)?</li>
<li>1.3.E (\(\star\))</li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
</div>
</div>


<div id="outline-container-org9caa603" class="outline-2">
<h2 id="org9caa603" class="collapsible">More things to read or watch</h2>
<div class="outline-text-2" id="text-org9caa603">
<ul class="org-ul">
<li><a href="https://math216.wordpress.com/agittoc-2020/">Ravi Vakil&rsquo;s pseudo-course website</a></li>
<li><a href="https://www.youtube.com/watch?v=BX3jiLdehA4&amp;list=PL8yHsr3EFj50Un2NpfPySgXctRQK7CLG-">Richard Borcherd&rsquo;s lectures on schemes</a></li>
<li><a href="pointsareprimes.pdf">Why are points of a scheme the prime ideals</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Created by <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5).  Last modified: 2022-05-31 Tue 15:55.  <a href="https://github.com/deopurkar.github.io">Source</a>
</div>
</body>
</html>
